[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:267:14
 
   const canInstall = (row) => {
     if (canInstallCourse !== undefined) {
-      return typeof canInstallCourse === "function"
+      return true
         ? canInstallCourse(row)
         : canInstallCourse;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests supports permission override props
statusReason: canInstallCourse is not a function
