[Timeout] BooleanLiteral
main/components/Courses/CourseWarningBanner.jsx:7:31
 export function CourseWarningBanner({
   courseId,
   orgName,
-  hideBasePermissionWarning = false,
+  hideBasePermissionWarning = true,
 }) {
   const { data: warnings } = useBackend(

[Killed] ObjectLiteral
main/components/Courses/CourseWarningBanner.jsx:11:5
 }) {
   const { data: warnings } = useBackend(
     [`/api/courses/warnings/${courseId}`],
-    {
-      method: "GET",
-      url: `/api/courses/warnings/${courseId}`,
-    },
+    {},
     undefined,
     true,
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: Unable to find an element with the text: /This GitHub Organization/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ObjectLiteral
main/components/Courses/CourseWarningBanner.jsx:18:24
     undefined,
     true,
     {
-      placeholderData: {
-        showOrganizationAgeWarning: false,
-        showDefaultBasePermissions: false,
-      },
+      placeholderData: {},
       staleTime: "static",
     },
killedBy: CourseWarningBanner tests renders warning banner on warning return
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/courses/warnings/1' ], …(4) ]

Received:

  1st useBackend call:

@@ -7,12 +7,9 @@
      "url": "/api/courses/warnings/1",

[Killed] BooleanLiteral
main/components/Courses/CourseWarningBanner.jsx:19:37
     true,
     {
       placeholderData: {
-        showOrganizationAgeWarning: false,
+        showOrganizationAgeWarning: true,
         showDefaultBasePermissions: false,
       },
killedBy: CourseWarningBanner tests renders warning banner on warning return
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/courses/warnings/1' ], …(4) ]

Received:

  1st useBackend call:

@@ -9,10 +9,10 @@
    undefined,

[Killed] BooleanLiteral
main/components/Courses/CourseWarningBanner.jsx:20:37
     {
       placeholderData: {
         showOrganizationAgeWarning: false,
-        showDefaultBasePermissions: false,
+        showDefaultBasePermissions: true,
       },
       staleTime: "static",
killedBy: CourseWarningBanner tests renders warning banner on warning return
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/courses/warnings/1' ], …(4) ]

Received:

  1st useBackend call:

@@ -8,11 +8,11 @@
    },

[Killed] LogicalOperator
main/components/Courses/CourseWarningBanner.jsx:27:5
   );
 
   const showDefaultBasePermissionWarning =
-    warnings?.showDefaultBasePermissions &&
-    orgName &&
-    !hideBasePermissionWarning;
+    warnings?.showDefaultBasePermissions && orgName || !hideBasePermissionWarning;
 
   const memberPrivilegesUrl = orgName
killedBy: InstructorCourseShowPage tests hides default base permission warning when hideBasePermissionWarning is true
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="fade alert alert-warning show"
  data-testid="CourseWarningBanner-defaultBasePermission"
  role="alert"
>
  Warning: the organization setting for Default Base Permission is not the recommended value of None. This means that students in the organization may be able to access other students' privat

[Killed] OptionalChaining
main/components/Courses/CourseWarningBanner.jsx:27:5
   );
 
   const showDefaultBasePermissionWarning =
-    warnings?.showDefaultBasePermissions &&
+    warnings.showDefaultBasePermissions &&
     orgName &&
     !hideBasePermissionWarning;
killedBy: InstructorCourseShowPage tests Cleans up correctly on unmount
statusReason: Unable to find an element with the text: Course not found. You will be returned to the course list in 3 seconds.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] BooleanLiteral
main/components/Courses/CourseWarningBanner.jsx:29:5
   const showDefaultBasePermissionWarning =
     warnings?.showDefaultBasePermissions &&
     orgName &&
-    !hideBasePermissionWarning;
+    hideBasePermissionWarning;
 
   const memberPrivilegesUrl = orgName
killedBy: InstructorCourseShowPage tests displays default base permission warning when hideBasePermissionWarning is omitted
statusReason: Unable to find an element by: [data-testid="CourseWarningBanner-defaultBasePermission"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] LogicalOperator
main/components/Courses/CourseWarningBanner.jsx:37:8
 
   return (
     <>
-      {warnings?.showOrganizationAgeWarning && (
-        <Alert variant="warning">
-          Warning: This GitHub Organization is less than 30 days old. You will
-          experience difficulties enrolling more than 50 students in a day.
-        </Alert>
-      )}
+      {warnings?.showOrganizationAgeWarning || <Alert variant="warning">
+          Warning: This GitHub Organization is less than 30 days old. You will
+          experience difficulties enrolling more than 50 students in a day.
+        </Alert>}
       {showDefaultBasePermissionWarning && (
         <Alert
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: Unable to find an element with the text: /This GitHub Organization/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/Courses/CourseWarningBanner.jsx:37:8
 
   return (
     <>
-      {warnings?.showOrganizationAgeWarning && (
-        <Alert variant="warning">
-          Warning: This GitHub Organization is less than 30 days old. You will
-          experience difficulties enrolling more than 50 students in a day.
-        </Alert>
-      )}
+      {false}
       {showDefaultBasePermissionWarning && (
         <Alert
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: Unable to find an element with the text: /This GitHub Organization/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] LogicalOperator
main/components/Courses/CourseWarningBanner.jsx:43:8
           experience difficulties enrolling more than 50 students in a day.
         </Alert>
       )}
-      {showDefaultBasePermissionWarning && (
-        <Alert
-          variant="warning"
-          data-testid="CourseWarningBanner-defaultBasePermission"
-        >
-          Warning: the organization setting for Default Base Permission is not
-          the recommended value of None. This means that students in the
-          organization may be able to access other students&apos; private repos.{" "}
-          <a
-            href={memberPrivilegesUrl}
-            target="_blank"
-            rel="noopener noreferrer"
-            data-testid="CourseWarningBanner-defaultBasePermission-link"
-          >
-            You can change that setting here
-          </a>
-          .
-        </Alert>
-      )}
+      {showDefaultBasePermissionWarning || <Alert variant="warning" data-testid="CourseWarningBanner-defaultBasePermission">
+          Warning: the organization setting for Default Base Permission is not
+          the recommended value of None. This means that students in the
+          organization may be able to access other students&apos; private repos.{" "}
+          <a href={memberPrivilegesUrl} target="_blank" rel="noopener noreferrer" data-testid="CourseWarningBanner-defaultBasePermission-link">
+            You can change that setting here
+          </a>
+          .
+        </Alert>}
     </>
   );
killedBy: InstructorCourseShowPage tests hides default base permission warning when hideBasePermissionWarning is true
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="fade alert alert-warning show"
  data-testid="CourseWarningBanner-defaultBasePermission"
  role="alert"
>
  Warning: the organization setting for Default Base Permission is not the recommended value of None. This means that students in the organization may be able to access other students' privat

[Killed] ConditionalExpression
main/components/Courses/CourseWarningBanner.jsx:43:8
           experience difficulties enrolling more than 50 students in a day.
         </Alert>
       )}
-      {showDefaultBasePermissionWarning && (
-        <Alert
-          variant="warning"
-          data-testid="CourseWarningBanner-defaultBasePermission"
-        >
-          Warning: the organization setting for Default Base Permission is not
-          the recommended value of None. This means that students in the
-          organization may be able to access other students&apos; private repos.{" "}
-          <a
-            href={memberPrivilegesUrl}
-            target="_blank"
-            rel="noopener noreferrer"
-            data-testid="CourseWarningBanner-defaultBasePermission-link"
-          >
-            You can change that setting here
-          </a>
-          .
-        </Alert>
-      )}
+      {false}
     </>
   );
killedBy: InstructorCourseShowPage tests displays default base permission warning when hideBasePermissionWarning is omitted
statusReason: Unable to find an element by: [data-testid="CourseWarningBanner-defaultBasePermission"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
