[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:105:11
   };
 
   const onSuccessAddTeamToGithub = () => {
-    toast("Add team to Github job successfully started.");
+    toast("");
   };
 
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Add team to Github job successfully started.",

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:119:22
         setPostTeamModal(false);
         if (error.response.status === 409) {
           setErrorPostTeamModal({
-            message: `Team name already exists. Please choose a different name.`,
+            message: ``,
           });
         } else {
killedBy: TeamTabComponent tests TeamForm (adding individual team) returns correct error when team already exists
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Team name already exists. Please choose a different name.
Received:
  Error Creating Team

[Killed] EqualityOperator
main/components/TabComponent/TeamsTabComponent.jsx:144:13
       onError: (error) => {
         setCsvModal(false);
         setSearchTeams("");
-        if (error.response.status === 400) {
+        if (error.response.status !== 400) {
           setErrorPostCSVTeamModal({
             message: `Upload failed (Error 400). Please ensure your CSV follows one of the formats documented in the 'Help' section.`,
killedBy: TeamTabComponent tests Uploads valid CSV with some rejected members and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-partial-success-post-csv-team-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:146:22
         setSearchTeams("");
         if (error.response.status === 400) {
           setErrorPostCSVTeamModal({
-            message: `Upload failed (Error 400). Please ensure your CSV follows one of the formats documented in the 'Help' section.`,
+            message: ``,
           });
         } else if (error.response.status === 409) {
killedBy: TeamTabComponent tests Returns correct modal for invalid CSV format and clears search filter
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Upload failed (Error 400). Please ensure your CSV follows one of the formats documented in the 'Help' section.
Received:
  CSV Import Unsuccessful

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:194:47
   };
 
   const openCsvHelp = () => {
-    window.open("/help/csv#team-information", "_blank");
+    window.open("/help/csv#team-information", "");
   };
 
killedBy: TeamTabComponent tests Info icon displays tooltip and opens help page on click
statusReason: expected "vi.fn()" to be called with arguments: [ '/help/csv#team-information', …(1) ]

Received:

  1st vi.fn() call:

  [
    "/help/csv#team-information",

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:348:49
       </Row>
       <Row>
         <TeamsTable
-          teams={(teams || []).filter((team) => {
-            const searchTermLower = searchTeams.toLowerCase();
-            if (team.name.toLowerCase().includes(searchTermLower)) {
-              return true;
-            }
-            return false;
-          })}
+          teams={(teams || []).filter((team) => {})}
           currentUser={currentUser}
           courseId={courseId}
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: Unable to find an element with the text: team1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] ConditionalExpression
main/components/TabComponent/TeamsTabComponent.jsx:350:17
         <TeamsTable
           teams={(teams || []).filter((team) => {
             const searchTermLower = searchTeams.toLowerCase();
-            if (team.name.toLowerCase().includes(searchTermLower)) {
+            if (true) {
               return true;
             }
killedBy: TeamTabComponent tests Search filter works correctly Search by Team Name.
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h3
  data-testid="InstructorCourseShowPage-teams-table-3-name"
>
  team1
</h3> instead
