[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:69:13
   });
 
   const cellToAxiosParamDeleteTeam = (team) => ({
-    method: "DELETE",
+    method: "",
     url: `/api/teams`,
     params: { id: team.id, courseId: courseId },
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:71:13
   const cellToAxiosParamDeleteTeam = (team) => ({
     method: "DELETE",
     url: `/api/teams`,
-    params: { id: team.id, courseId: courseId },
+    params: {},
   });
 
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected {} to deeply equal { id: 3, courseId: '12' }

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:76:10
 
   const cellToAxiosParamDeleteMember = (member) => ({
     method: "DELETE",
-    url: `/api/teams/removeMember`,
+    url: ``,
     params: { teamMemberId: member.id, courseId: courseId },
   });
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected '' to be '/api/teams/removeMember' // Object.is equality

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:89:13
   const cellToAxiosParamDeleteGithubMember = (data) => ({
     method: "POST",
     url: `/api/jobs/launch/deleteTeamMemberFromGithub`,
-    params: {
-      memberGithubLogin: data.memberGithubLogin,
-      githubTeamId: data.githubTeamId,
-      courseId: courseId,
-    },
+    params: {},
   });
 
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected {} to deeply equal { Object (memberGithubLogin, githubTeamId, ...) }

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:139:5
 
   const memberPostMutation = useBackendMutation(
     cellToAxiosParamsPost,
-    {
-      onSuccess: (createdTeamMember) => {
-        onSuccessMember(setPostMemberModal);
-        const rosterStudent = rosterStudents.find(
-          (rs) => rs.id === createdTeamMember.rosterStudent.id,
-        );
-        addGithubMemberMutation.mutate({
-          memberGithubLogin: rosterStudent.githubLogin,
-          githubTeamId: selectedTeam.githubTeamId,
-          teamMemberId: createdTeamMember.id,
-        });
-      },
-      onError: (error) => {
-        setPostMemberModal(false);
-        if (error.response.status === 409) {
-          setErrorPostMemberModal({
-            message: `This member is already in this team.`,
-          });
-        } else {
-          setErrorPostMemberModal({
-            message: `${JSON.stringify(error.status)} error occurred while adding member to the team.`,
-          });
-        }
-      },
-    },
+    {},
     [`/api/teams/all?courseId=${courseId}`],
   );
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected 1 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:153:44
       },
       onError: (error) => {
         setPostMemberModal(false);
-        if (error.response.status === 409) {
-          setErrorPostMemberModal({
-            message: `This member is already in this team.`,
-          });
-        } else {
+        if (error.response.status === 409) {} else {
           setErrorPostMemberModal({
             message: `${JSON.stringify(error.status)} error occurred while adding member to the team.`,
killedBy: TeamsTable tests add member returns 409 error modal when member is already in the team
statusReason: Unable to find an element by: [data-testid="TeamsTable-error-post-member-modal"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:186:5
   };
 
   const memberColumns = [
-    {
-      Header: "Roster Student ID",
-      accessor: "rosterStudent.id",
-    },
+    {},
     {
       Header: "First Name",
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: Unable to find an element with the text: team1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] LogicalOperator
main/components/Teams/TeamsTable.jsx:208:21
     },
   ];
 
-  const canManage = canManageTeams ?? hasRole(currentUser, "ROLE_INSTRUCTOR");
+  const canManage = canManageTeams && hasRole(currentUser, "ROLE_INSTRUCTOR");
 
   return (
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-teams-table-3-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:208:60
     },
   ];
 
-  const canManage = canManageTeams ?? hasRole(currentUser, "ROLE_INSTRUCTOR");
+  const canManage = canManageTeams ?? hasRole(currentUser, "");
 
   return (
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-teams-table-3-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:233:22
         show={errorPostMemberModal}
         onHide={() => setErrorPostMemberModal(false)}
         centered={true}
-        data-testid={`${testIdPrefix}-error-post-member-modal`}
+        data-testid={``}
       >
         <ModalHeader closeButton>
killedBy: TeamsTable tests add member returns 409 error modal when member is already in the team
statusReason: Unable to find an element by: [data-testid="TeamsTable-error-post-member-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:285:27
                     ? [
                         ButtonColumn(
                           "Remove",
-                          "danger",
+                          "",
                           (cell) => deleteMemberCallback(cell, team),
                           `${testIdPrefix}-${team.id}`,
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:287:27
                           "Remove",
                           "danger",
                           (cell) => deleteMemberCallback(cell, team),
-                          `${testIdPrefix}-${team.id}`,
+                          ``,
                         ),
                       ]
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-cell-row-0-col-Remove-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"
