[Killed] ConditionalExpression
src/main/pages/HomePageLoggedIn.jsx:141:10
         <h1>Your Student Courses</h1>
         <StudentCoursesTable testid={"CoursesTable"} />
         <h1>Your Staff Courses</h1>
-        {staffCourses.length === 0 && <p>No staff courses yet.</p>}
+        {false}
         {staffCourses.length > 0 && (
           <CoursesTable
killedBy: HomePageLoggedIn tests staff courses section renders empty message when there are no staffCourses
statusReason: Unable to find an element with the text: No staff courses yet.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/HomePageLoggedIn.jsx:142:10
         <StudentCoursesTable testid={"CoursesTable"} />
         <h1>Your Staff Courses</h1>
         {staffCourses.length === 0 && <p>No staff courses yet.</p>}
-        {staffCourses.length > 0 && (
-          <CoursesTable
-            courses={staffCourses}
-            testId={"StaffCoursesTable"}
-            joinCallback={joinStaffCourseCallback}
-            isLoading={isStaffJoining}
-            courseNameLinkPrefix="/staff/courses"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: HomePageLoggedIn tests right message on 400
statusReason: Unable to find an element by: [data-testid="StaffCoursesTable-cell-row-1-col-studentStatus-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
