[Killed] BooleanLiteral
main/pages/Staff/StaffCourseShowPage.jsx:142:30
             courseId={courseId}
             testIdPrefix={testId}
             currentUser={currentUser}
-            canEditStudents={true}
+            canEditStudents={false}
           />
         </Tab>
killedBy: StaffCourseShowPage tests staff users can still manage students and teams
statusReason: Unable to find an element by: [data-testid="StaffCourseShowPage-RosterStudentTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/pages/Staff/StaffCourseShowPage.jsx:158:29
             courseId={courseId}
             testIdPrefix={testId}
             currentUser={currentUser}
-            canManageTeams={true}
+            canManageTeams={false}
           />
         </Tab>
killedBy: StaffCourseShowPage tests staff users can still manage students and teams
statusReason: Unable to find an element by: [data-testid="StaffCourseShowPage-teams-table-3-add-member-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
