[Killed] ArrayDeclaration
main/pages/Student/StudentCourseShowPage.jsx:13:5
   const courseId = useParams().id;
 
   const { data: course } = useBackend(
-    [`/api/courses/${courseId}`],
+    [],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/courses/${courseId}` },
killedBy: StudentCourseShowPage tests renders course header and placeholder tab
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/courses/1' ], …(3) ]

Received:

  1st useBackend call:

@@ -1,9 +1,7 @@
  [

[Killed] StringLiteral
main/pages/Student/StudentCourseShowPage.jsx:38:46
         </div>
       )}
       <Tabs defaultActiveKey={"placeholder"}>
-        <Tab eventKey={"placeholder"} title={"Placeholder"} className="pt-2">
+        <Tab eventKey={"placeholder"} title={""} className="pt-2">
           <p>More features coming soon</p>
         </Tab>
killedBy: StudentCourseShowPage tests renders course header and placeholder tab
statusReason: Unable to find an element with the text: Placeholder. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
