[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:182:45
           <JobTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
         {showSettingsTab && (
-          <Tab eventKey={"settings"} title={"Settings"} className="pt-2">
+          <Tab eventKey={"settings"} title={""} className="pt-2">
             <SettingsTabComponent courseId={courseId} testIdPrefix={testId} />
           </Tab>
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: Unable to find an element with the text: Settings. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:182:26
           <JobTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
         {showSettingsTab && (
-          <Tab eventKey={"settings"} title={"Settings"} className="pt-2">
+          <Tab eventKey={""} title={"Settings"} className="pt-2">
             <SettingsTabComponent courseId={courseId} testIdPrefix={testId} />
           </Tab>
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("data-rr-ui-event-key", "settings") // element.getAttribute("data-rr-ui-event-key") === "settings"

Expected the element to have attribute:
  data-rr-ui-event-key="settings"
Received:
  data-rr-ui-event-key=""
