[Killed] BlockStatement
main/pages/Instructor/InstructorCourseShowPage.jsx:19:50
 import SettingsTabComponent from "main/components/TabComponent/SettingsTabComponent";
 import JobTabComponent from "main/components/TabComponent/JobTabComponent";
 
-function formatDefaultBasePermission(permission) {
-  if (permission == null || typeof permission !== "string") {
-    return null;
-  }
-  const trimmed = permission.trim().toLowerCase();
-  switch (trimmed) {
-    case "none":
-      return "None";
-    case "read":
-      return "Read";
-    case "write":
-      return "Write";
-    default:
-      return (
-        permission.charAt(0).toUpperCase() + permission.slice(1).toLowerCase()
-      );
-  }
-}
+function formatDefaultBasePermission(permission) {}
 
 function DefaultBasePermissionOnCourseHeader({ courseId, testId }) {
killedBy: InstructorCourseShowPage tests displays default base permission on course header when linked to GitHub org
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-default-base-permission-value"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:20:7
 import JobTabComponent from "main/components/TabComponent/JobTabComponent";
 
 function formatDefaultBasePermission(permission) {
-  if (permission == null || typeof permission !== "string") {
+  if (true) {
     return null;
   }
killedBy: InstructorCourseShowPage tests displays default base permission on course header when linked to GitHub org
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-default-base-permission-value"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:20:7
 import JobTabComponent from "main/components/TabComponent/JobTabComponent";
 
 function formatDefaultBasePermission(permission) {
-  if (permission == null || typeof permission !== "string") {
+  if (false) {
     return null;
   }
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: Unable to find an element with the text: CMPSC 156. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Survived] MethodExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:23:19
   if (permission == null || typeof permission !== "string") {
     return null;
   }
-  const trimmed = permission.trim().toLowerCase();
+  const trimmed = permission.trim().toUpperCase();
   switch (trimmed) {
     case "none":

[Survived] MethodExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:23:19
   if (permission == null || typeof permission !== "string") {
     return null;
   }
-  const trimmed = permission.trim().toLowerCase();
+  const trimmed = permission.toLowerCase();
   switch (trimmed) {
     case "none":

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:25:5
   }
   const trimmed = permission.trim().toLowerCase();
   switch (trimmed) {
-    case "none":
-      return "None";
+    case "none":
     case "read":
       return "Read";
killedBy: InstructorCourseShowPage tests displays none as None on course header
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  None
Received:
  Read

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:27:5
   switch (trimmed) {
     case "none":
       return "None";
-    case "read":
-      return "Read";
+    case "read":
     case "write":
       return "Write";
killedBy: InstructorCourseShowPage tests displays default base permission on course header when linked to GitHub org
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Read
Received:
  Write

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:28:14
     case "none":
       return "None";
     case "read":
-      return "Read";
+      return "";
     case "write":
       return "Write";
killedBy: InstructorCourseShowPage tests displays default base permission on course header when linked to GitHub org
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-default-base-permission-value"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Survived] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:29:5
       return "None";
     case "read":
       return "Read";
-    case "write":
-      return "Write";
+    case "write":
     default:
       return (

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:30:14
     case "read":
       return "Read";
     case "write":
-      return "Write";
+      return "";
     default:
       return (
killedBy: InstructorCourseShowPage tests displays write as Write on course header
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-default-base-permission-value"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Survived] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:31:5
       return "Read";
     case "write":
       return "Write";
-    default:
-      return (
-        permission.charAt(0).toUpperCase() + permission.slice(1).toLowerCase()
-      );
+    default:
   }
 }

[Survived] MethodExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:33:9
       return "Write";
     default:
       return (
-        permission.charAt(0).toUpperCase() + permission.slice(1).toLowerCase()
+        permission.toUpperCase() + permission.slice(1).toLowerCase()
       );
   }

[Survived] MethodExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:33:46
       return "Write";
     default:
       return (
-        permission.charAt(0).toUpperCase() + permission.slice(1).toLowerCase()
+        permission.charAt(0).toUpperCase() + permission.toLowerCase()
       );
   }

[Survived] ArrayDeclaration
main/pages/Instructor/InstructorCourseShowPage.jsx:40:5
 
 function DefaultBasePermissionOnCourseHeader({ courseId, testId }) {
   const { data: defaultBasePermissionRaw } = useBackend(
-    ["/api/github/graphql/defaultbasepermission", courseId],
+    [],
     {
       method: "GET",

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:43:12
     ["/api/github/graphql/defaultbasepermission", courseId],
     {
       method: "GET",
-      url: "/api/github/graphql/defaultbasepermission",
+      url: "",
       params: { courseId },
     },
killedBy: InstructorCourseShowPage tests displays default base permission on course header when linked to GitHub org
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-default-base-permission-value"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ObjectLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:44:15
     {
       method: "GET",
       url: "/api/github/graphql/defaultbasepermission",
-      params: { courseId },
+      params: {},
     },
     undefined,
killedBy: InstructorCourseShowPage tests displays default base permission on course header when linked to GitHub org
statusReason: expected [] to have a length of 1 but got +0

[Survived] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:47:5
       params: { courseId },
     },
     undefined,
-    true,
+    false,
     {
       staleTime: Infinity,

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:57:7
     defaultBasePermissionRaw,
   );
 
-  if (!defaultBasePermissionDisplay) {
+  if (defaultBasePermissionDisplay) {
     return null;
   }
killedBy: InstructorCourseShowPage tests displays default base permission on course header when linked to GitHub org
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Read
Received:

[Killed] BlockStatement
main/pages/Instructor/InstructorCourseShowPage.jsx:57:38
     defaultBasePermissionRaw,
   );
 
-  if (!defaultBasePermissionDisplay) {
-    return null;
-  }
+  if (!defaultBasePermissionDisplay) {}
 
   return (
killedBy: InstructorCourseShowPage tests displays default base permission on course header when linked to GitHub org
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Read
Received:

[Survived] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:64:8
   return (
     <div data-testid={`${testId}-default-base-permission`}>
       <span className="text-muted">Default Base Permission</span>
-      {": "}
+      {""}
       <span data-testid={`${testId}-default-base-permission-value`}>
         {defaultBasePermissionDisplay}

[Killed] EqualityOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:90:27
     true,
   );
 
-  const getCourseFailed = courseBackendFailureCount > 0;
+  const getCourseFailed = courseBackendFailureCount <= 0;
 
   const linkedGithubOrg = Boolean(course?.orgName && course?.installationId);
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Course Not Found
</div> instead

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:92:35
 
   const getCourseFailed = courseBackendFailureCount > 0;
 
-  const linkedGithubOrg = Boolean(course?.orgName && course?.installationId);
+  const linkedGithubOrg = Boolean(false);
 
   const navigate = useNavigate();
killedBy: InstructorCourseShowPage tests displays default base permission on course header when linked to GitHub org
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-default-base-permission-value"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:92:35
 
   const getCourseFailed = courseBackendFailureCount > 0;
 
-  const linkedGithubOrg = Boolean(course?.orgName && course?.installationId);
+  const linkedGithubOrg = Boolean(true);
 
   const navigate = useNavigate();
killedBy: InstructorCourseShowPage tests does not display default base permission when course has no linked GitHub org
statusReason: expected [ { transitional: { …(4) }, …(15) } ] to have a length of +0 but got 1

[Killed] OptionalChaining
main/pages/Instructor/InstructorCourseShowPage.jsx:127:18
       </Modal>
       <CourseWarningBanner
         courseId={courseId}
-        orgName={course?.orgName}
+        orgName={course.orgName}
         hideBasePermissionWarning={course?.hideBasePermissionWarning ?? false}
       />
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of null (reading 'orgName')

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:128:73
       <CourseWarningBanner
         courseId={courseId}
         orgName={course?.orgName}
-        hideBasePermissionWarning={course?.hideBasePermissionWarning ?? false}
+        hideBasePermissionWarning={course?.hideBasePermissionWarning ?? true}
       />
       {!course ? (
killedBy: InstructorCourseShowPage tests displays default base permission warning when hideBasePermissionWarning is omitted
statusReason: Unable to find an element by: [data-testid="CourseWarningBanner-defaultBasePermission"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] OptionalChaining
main/pages/Instructor/InstructorCourseShowPage.jsx:128:36
       <CourseWarningBanner
         courseId={courseId}
         orgName={course?.orgName}
-        hideBasePermissionWarning={course?.hideBasePermissionWarning ?? false}
+        hideBasePermissionWarning={course.hideBasePermissionWarning ?? false}
       />
       {!course ? (
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of null (reading 'hideBasePermissionWarning')

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:130:8
         orgName={course?.orgName}
         hideBasePermissionWarning={course?.hideBasePermissionWarning ?? false}
       />
-      {!course ? (
+      {course ? (
         <div data-testid={`${testId}-loading`}>Course: Loading...</div>
       ) : (
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of null (reading 'orgName')

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:159:27
               {course.orgName && (
                 <div className="d-flex align-items-center gap-2">
                   <a
-                    href={`https://github.com/${course.orgName}`}
+                    href={``}
                     target="_blank"
                     rel="noopener noreferrer"
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: expect(element).toHaveAttribute("href", "https://github.com/ucsb-cs156-s25") // element.getAttribute("href") === "https://github.com/ucsb-cs156-s25"

Expected the element to have attribute:
  href="https://github.com/ucsb-cs156-s25"
Received:
  href=""

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:185:40
                       >
                         <GithubSettingIcon
                           size={20}
-                          data-testid={`${testId}-github-settings-icon`}
+                          data-testid={``}
                         />
                       </a>
killedBy: InstructorCourseShowPage tests expect the correct tooltip ID and message for the github icon (that redirects to github installation settings)
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-github-settings-icon"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:192:16
                   )}
                 </div>
               )}
-              {linkedGithubOrg && (
-                <DefaultBasePermissionOnCourseHeader
-                  courseId={courseId}
-                  testId={testId}
-                />
-              )}
+              {false}
             </div>
           </div>
killedBy: InstructorCourseShowPage tests displays default base permission on course header when linked to GitHub org
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-default-base-permission-value"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:192:16
                   )}
                 </div>
               )}
-              {linkedGithubOrg && (
-                <DefaultBasePermissionOnCourseHeader
-                  courseId={courseId}
-                  testId={testId}
-                />
-              )}
+              {true}
             </div>
           </div>
killedBy: InstructorCourseShowPage tests displays default base permission on course header when linked to GitHub org
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-default-base-permission-value"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:210:40
             currentUser={currentUser}
           />
         </Tab>
-        <Tab eventKey={"staff"} title={"Staff"} className="pt-2">
+        <Tab eventKey={"staff"} title={""} className="pt-2">
           <StaffTabComponent
             courseId={courseId}
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: Unable to find an accessible element with the role "tab" and name "Staff"

Here are the accessible roles:

  navigation:

  Name "":
  <nav
