[Killed] BooleanLiteral
main/components/TabComponent/StaffTabComponent.jsx:26:44
   currentUser,
 }) {
   const [postModal, showPostModal] = useState(false);
-  const [csvModal, setCsvModal] = useState(false);
+  const [csvModal, setCsvModal] = useState(true);
   const { data: courseStaff } = useBackend(
     [`/api/coursestaff/course?courseId=${courseId}`],
killedBy: InstructorCourseShowPage tests does not show error modal on initial render
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] ArrayDeclaration
main/components/TabComponent/StaffTabComponent.jsx:28:5
   const [postModal, showPostModal] = useState(false);
   const [csvModal, setCsvModal] = useState(false);
   const { data: courseStaff } = useBackend(
-    [`/api/coursestaff/course?courseId=${courseId}`],
+    [],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/coursestaff/course?courseId=${courseId}` },
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: expected undefined to strictly equal []

[Killed] ArrowFunction
main/components/TabComponent/StaffTabComponent.jsx:36:35
   );
   const [searchTerm, setSearchTerm] = useState("");
 
-  const objectToAxiosParamsPost = (staff) => ({
-    url: `/api/coursestaff/post`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      firstName: staff.firstName,
-      lastName: staff.lastName,
-      email: staff.email,
-    },
-  });
+  const objectToAxiosParamsPost = () => undefined;
 
   const objectToAxiosParamsCSV = (formData) => {
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/TabComponent/StaffTabComponent.jsx:36:47
   );
   const [searchTerm, setSearchTerm] = useState("");
 
-  const objectToAxiosParamsPost = (staff) => ({
-    url: `/api/coursestaff/post`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      firstName: staff.firstName,
-      lastName: staff.lastName,
-      email: staff.email,
-    },
-  });
+  const objectToAxiosParamsPost = (staff) => ({});
 
   const objectToAxiosParamsCSV = (formData) => {
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:37:10
   const [searchTerm, setSearchTerm] = useState("");
 
   const objectToAxiosParamsPost = (staff) => ({
-    url: `/api/coursestaff/post`,
+    url: ``,
     method: "POST",
     params: {
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Staff roster successfully updated.",

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:38:13
 
   const objectToAxiosParamsPost = (staff) => ({
     url: `/api/coursestaff/post`,
-    method: "POST",
+    method: "",
     params: {
       courseId: courseId,
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/TabComponent/StaffTabComponent.jsx:47:48
     },
   });
 
-  const objectToAxiosParamsCSV = (formData) => {
-    const file = new FormData();
-    file.append("file", formData.upload[0]);
-    return {
-      url: `/api/coursestaff/upload/csv`,
-      data: file,
-      params: {
-        courseId: courseId,
-      },
-      method: "POST",
-    };
-  };
+  const objectToAxiosParamsCSV = (formData) => {};
 
   const onSuccessStaff = (modalFn) => {
killedBy: StaffTabComponent Tests CSV upload submits and invalidates cache
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:51:12
     const file = new FormData();
     file.append("file", formData.upload[0]);
     return {
-      url: `/api/coursestaff/upload/csv`,
+      url: ``,
       data: file,
       params: {
killedBy: StaffTabComponent Tests CSV upload submits and invalidates cache
statusReason: expected '' to be '/api/coursestaff/upload/csv' // Object.is equality

[Killed] BlockStatement
main/components/TabComponent/StaffTabComponent.jsx:60:39
     };
   };
 
-  const onSuccessStaff = (modalFn) => {
-    toast("Staff roster successfully updated.");
-    // Clear the search filter to show the updated roster
-    setSearchTerm("");
-    modalFn(false);
-  };
+  const onSuccessStaff = (modalFn) => {};
 
   const staffPostMutation = useBackendMutation(
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:61:11
   };
 
   const onSuccessStaff = (modalFn) => {
-    toast("Staff roster successfully updated.");
+    toast("");
     // Clear the search filter to show the updated roster
     setSearchTerm("");
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Staff roster successfully updated.",

[Killed] ArrowFunction
main/components/TabComponent/StaffTabComponent.jsx:69:18
 
   const staffPostMutation = useBackendMutation(
     objectToAxiosParamsPost,
-    { onSuccess: () => onSuccessStaff(showPostModal) },
+    { onSuccess: () => undefined },
     [`/api/coursestaff/course?courseId=${courseId}`],
   );
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ArrayDeclaration
main/components/TabComponent/StaffTabComponent.jsx:70:5
   const staffPostMutation = useBackendMutation(
     objectToAxiosParamsPost,
     { onSuccess: () => onSuccessStaff(showPostModal) },
-    [`/api/coursestaff/course?courseId=${courseId}`],
+    [],
   );
 
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: expected +0 to deeply equal 1

[Killed] ObjectLiteral
main/components/TabComponent/StaffTabComponent.jsx:75:5
 
   const staffCsvMutation = useBackendMutation(
     objectToAxiosParamsCSV,
-    {
-      onSuccess: () => onSuccessStaff(setCsvModal),
-      onError: (error) => {
-        toast.error(
-          `Error uploading CSV: ${JSON.stringify(error.response.data, null, 2)}`,
-        );
-        setCsvModal(false);
-      },
-    },
+    {},
     [`/api/coursestaff/course?courseId=${courseId}`],
   );
killedBy: StaffTabComponent Tests CSV upload submits and invalidates cache
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ArrowFunction
main/components/TabComponent/StaffTabComponent.jsx:76:18
   const staffCsvMutation = useBackendMutation(
     objectToAxiosParamsCSV,
     {
-      onSuccess: () => onSuccessStaff(setCsvModal),
+      onSuccess: () => undefined,
       onError: (error) => {
         toast.error(
killedBy: StaffTabComponent Tests CSV upload submits and invalidates cache
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/TabComponent/StaffTabComponent.jsx:77:27
     objectToAxiosParamsCSV,
     {
       onSuccess: () => onSuccessStaff(setCsvModal),
-      onError: (error) => {
-        toast.error(
-          `Error uploading CSV: ${JSON.stringify(error.response.data, null, 2)}`,
-        );
-        setCsvModal(false);
-      },
+      onError: (error) => {},
     },
     [`/api/coursestaff/course?courseId=${courseId}`],
killedBy: StaffTabComponent Tests CSV upload shows error toast on failure
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
main/components/TabComponent/StaffTabComponent.jsx:81:21
         toast.error(
           `Error uploading CSV: ${JSON.stringify(error.response.data, null, 2)}`,
         );
-        setCsvModal(false);
+        setCsvModal(true);
       },
     },
killedBy: StaffTabComponent Tests CSV upload shows error toast on failure
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-csv-modal"
>
  <div
    class="modal-content"

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:84:6
         setCsvModal(false);
       },
     },
-    [`/api/coursestaff/course?courseId=${courseId}`],
+    [``],
   );
 
killedBy: StaffTabComponent Tests CSV upload submits and invalidates cache
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] BlockStatement
main/components/TabComponent/StaffTabComponent.jsx:87:39
     [`/api/coursestaff/course?courseId=${courseId}`],
   );
 
-  const handlePostSubmit = (staff) => {
-    staffPostMutation.mutate(staff);
-  };
+  const handlePostSubmit = (staff) => {};
 
   const handleCsvSubmit = (formData) => {
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/TabComponent/StaffTabComponent.jsx:91:41
     staffPostMutation.mutate(staff);
   };
 
-  const handleCsvSubmit = (formData) => {
-    staffCsvMutation.mutate(formData);
-  };
+  const handleCsvSubmit = (formData) => {};
 
   const openCsvHelp = () => {
killedBy: StaffTabComponent Tests CSV upload submits and invalidates cache
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/TabComponent/StaffTabComponent.jsx:95:29
     staffCsvMutation.mutate(formData);
   };
 
-  const openCsvHelp = () => {
-    window.open("/help/csv#staff-information", "_blank");
-  };
+  const openCsvHelp = () => {};
 
   // Render tooltip for disabled buttons
killedBy: StaffTabComponent Tests CSV help icon opens help page
statusReason: expected "vi.fn()" to be called with arguments: [ '/help/csv#staff-information', …(1) ]

Number of calls: 0

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:96:48
   };
 
   const openCsvHelp = () => {
-    window.open("/help/csv#staff-information", "_blank");
+    window.open("/help/csv#staff-information", "");
   };
 
killedBy: StaffTabComponent Tests CSV help icon opens help page
statusReason: expected "vi.fn()" to be called with arguments: [ '/help/csv#staff-information', …(1) ]

Received:

  1st vi.fn() call:

  [
    "/help/csv#staff-information",

[Killed] ArrowFunction
main/components/TabComponent/StaffTabComponent.jsx:100:35
   };
 
   // Render tooltip for disabled buttons
-  const renderComingSoonTooltip = (props) => (
-    <Tooltip id="coming-soon-tooltip" {...props}>
-      Coming Soon
-    </Tooltip>
-  );
+  const renderComingSoonTooltip = () => undefined;
 
   return (
killedBy: StaffTabComponent Tests for coming soon tooltip on disabled download CSV button
statusReason: The argument must be a React element, but you passed undefined.

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:107:23
   );
 
   return (
-    <div data-testid={`${testIdPrefix}-StaffTabComponent`}>
+    <div data-testid={``}>
       <Modal
         show={postModal}
killedBy: StaffTabComponent Tests StaffTabComponent Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-StaffTabComponent"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid=""
    >

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:126:22
         show={csvModal}
         onHide={() => setCsvModal(false)}
         centered={true}
-        data-testid={`${testIdPrefix}-csv-modal`}
+        data-testid={``}
       >
         <ModalHeader closeButton>Upload Staff CSV</ModalHeader>
killedBy: StaffTabComponent Tests Upload Staff CSV button opens modal
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ObjectLiteral
main/components/TabComponent/StaffTabComponent.jsx:153:24
             >
               <BsInfoCircle
                 onClick={openCsvHelp}
-                style={{
-                  position: "absolute",
-                  top: "50%",
-                  right: "0.75rem",
-                  transform: "translateY(-50%)",
-                  color: "#fff",
-                  cursor: "pointer",
-                  fontSize: "0.9rem",
-                  userSelect: "none",
-                }}
+                style={{}}
                 data-testid={`${testIdPrefix}-csv-info-icon`}
               />
killedBy: StaffTabComponent Tests CSV help icon opens help page
statusReason: expect(element).toHaveStyle()

- Expected

- color: rgb(255, 255, 255);
- cursor: pointer;
- fontSize: 0.9rem;
- position: absolute;

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:163:30
                   fontSize: "0.9rem",
                   userSelect: "none",
                 }}
-                data-testid={`${testIdPrefix}-csv-info-icon`}
+                data-testid={``}
               />
             </OverlayTrigger>
killedBy: StaffTabComponent Tests CSV help icon opens help page
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-info-icon"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BlockStatement
main/components/TabComponent/StaffTabComponent.jsx:212:54
       </Row>
       <Row>
         <CourseStaffTable
-          staff={courseStaff.filter((staffMember) => {
-            const searchTermLower = searchTerm.toLowerCase();
-            const fullName = `${staffMember.firstName} ${staffMember.lastName}`;
-            if (staffMember.email.toLowerCase().includes(searchTermLower)) {
-              return true;
-            } else if (
-              staffMember.githubLogin?.toLowerCase().includes(searchTermLower)
-            ) {
-              return true;
-            } else if (fullName.toLowerCase().includes(searchTermLower)) {
-              return true;
-            }
-            return false;
-          })}
+          staff={courseStaff.filter((staffMember) => {})}
           currentUser={currentUser}
           courseId={courseId}
killedBy: StaffTabComponent Tests StaffTabComponent Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-CourseStaffTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] MethodExpression
main/components/TabComponent/StaffTabComponent.jsx:212:18
       </Row>
       <Row>
         <CourseStaffTable
-          staff={courseStaff.filter((staffMember) => {
-            const searchTermLower = searchTerm.toLowerCase();
-            const fullName = `${staffMember.firstName} ${staffMember.lastName}`;
-            if (staffMember.email.toLowerCase().includes(searchTermLower)) {
-              return true;
-            } else if (
-              staffMember.githubLogin?.toLowerCase().includes(searchTermLower)
-            ) {
-              return true;
-            } else if (fullName.toLowerCase().includes(searchTermLower)) {
-              return true;
-            }
-            return false;
-          })}
+          staff={courseStaff}
           currentUser={currentUser}
           courseId={courseId}
killedBy: StaffTabComponent Tests Search filter works correctly First Name, Email
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Mark
Received:
  Dr. John

[Killed] MethodExpression
main/components/TabComponent/StaffTabComponent.jsx:213:37
       <Row>
         <CourseStaffTable
           staff={courseStaff.filter((staffMember) => {
-            const searchTermLower = searchTerm.toLowerCase();
+            const searchTermLower = searchTerm.toUpperCase();
             const fullName = `${staffMember.firstName} ${staffMember.lastName}`;
             if (staffMember.email.toLowerCase().includes(searchTermLower)) {
killedBy: StaffTabComponent Tests Search filter works correctly First Name, Email
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-CourseStaffTable-cell-row-0-col-firstName"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:214:30
         <CourseStaffTable
           staff={courseStaff.filter((staffMember) => {
             const searchTermLower = searchTerm.toLowerCase();
-            const fullName = `${staffMember.firstName} ${staffMember.lastName}`;
+            const fullName = ``;
             if (staffMember.email.toLowerCase().includes(searchTermLower)) {
               return true;
killedBy: StaffTabComponent Tests Search filter works correctly First Name, Email
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-CourseStaffTable-cell-row-0-col-firstName"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/TabComponent/StaffTabComponent.jsx:215:17
           staff={courseStaff.filter((staffMember) => {
             const searchTermLower = searchTerm.toLowerCase();
             const fullName = `${staffMember.firstName} ${staffMember.lastName}`;
-            if (staffMember.email.toLowerCase().includes(searchTermLower)) {
+            if (true) {
               return true;
             } else if (
killedBy: StaffTabComponent Tests Search filter works correctly First Name, Email
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Mark
Received:
  Dr. John

[Killed] BlockStatement
main/components/TabComponent/StaffTabComponent.jsx:215:76
           staff={courseStaff.filter((staffMember) => {
             const searchTermLower = searchTerm.toLowerCase();
             const fullName = `${staffMember.firstName} ${staffMember.lastName}`;
-            if (staffMember.email.toLowerCase().includes(searchTermLower)) {
-              return true;
-            } else if (
+            if (staffMember.email.toLowerCase().includes(searchTermLower)) {} else if (
               staffMember.githubLogin?.toLowerCase().includes(searchTermLower)
             ) {
killedBy: StaffTabComponent Tests StaffTabComponent Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-CourseStaffTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] BooleanLiteral
main/components/TabComponent/StaffTabComponent.jsx:216:22
             const searchTermLower = searchTerm.toLowerCase();
             const fullName = `${staffMember.firstName} ${staffMember.lastName}`;
             if (staffMember.email.toLowerCase().includes(searchTermLower)) {
-              return true;
+              return false;
             } else if (
               staffMember.githubLogin?.toLowerCase().includes(searchTermLower)
killedBy: StaffTabComponent Tests StaffTabComponent Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-CourseStaffTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] ConditionalExpression
main/components/TabComponent/StaffTabComponent.jsx:218:15
             if (staffMember.email.toLowerCase().includes(searchTermLower)) {
               return true;
             } else if (
-              staffMember.githubLogin?.toLowerCase().includes(searchTermLower)
+              false
             ) {
               return true;
killedBy: StaffTabComponent Tests Search filter works correctly GitHub Login, Student ID
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-CourseStaffTable-cell-row-0-col-githubLogin"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] MethodExpression
main/components/TabComponent/StaffTabComponent.jsx:218:15
             if (staffMember.email.toLowerCase().includes(searchTermLower)) {
               return true;
             } else if (
-              staffMember.githubLogin?.toLowerCase().includes(searchTermLower)
+              staffMember.githubLogin?.toUpperCase().includes(searchTermLower)
             ) {
               return true;
killedBy: StaffTabComponent Tests Search filter works correctly GitHub Login, Student ID
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-CourseStaffTable-cell-row-0-col-githubLogin"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BlockStatement
main/components/TabComponent/StaffTabComponent.jsx:219:15
               return true;
             } else if (
               staffMember.githubLogin?.toLowerCase().includes(searchTermLower)
-            ) {
-              return true;
-            } else if (fullName.toLowerCase().includes(searchTermLower)) {
+            ) {} else if (fullName.toLowerCase().includes(searchTermLower)) {
               return true;
             }
killedBy: StaffTabComponent Tests Search filter works correctly GitHub Login, Student ID
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-CourseStaffTable-cell-row-0-col-githubLogin"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
