[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffCSVUploadForm.jsx:25:12
           {...register("upload", { required: true })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.upload && "Staff CSV is required. "}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: CourseStaffCSVUploadForm tests shows validation error when no file is selected
statusReason: Unable to find an element with the text: Staff CSV is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/CourseStaff/CourseStaffCSVUploadForm.jsx:25:12
           {...register("upload", { required: true })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.upload && "Staff CSV is required. "}
+          {errors.upload || "Staff CSV is required. "}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: CourseStaffCSVUploadForm tests shows validation error when no file is selected
statusReason: Unable to find an element with the text: Staff CSV is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
