[Killed] BlockStatement
main/pages/Help/HelpCsvPage.jsx:10:19
 export default function HelpCsvPage() {
   const location = useLocation();
 
-  useEffect(() => {
-    if (!location.hash) return;
-    const element = document.getElementById(location.hash.slice(1));
-    if (element) {
-      element.scrollIntoView();
-    }
-  }, [location.hash]);
+  useEffect(() => {}, [location.hash]);
 
   return (
killedBy: HelpCsvPage tests scrolls to teams section when hash is present
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
main/pages/Help/HelpCsvPage.jsx:11:9
   const location = useLocation();
 
   useEffect(() => {
-    if (!location.hash) return;
+    if (true) return;
     const element = document.getElementById(location.hash.slice(1));
     if (element) {
killedBy: HelpCsvPage tests scrolls to teams section when hash is present
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
main/pages/Help/HelpCsvPage.jsx:11:9
   const location = useLocation();
 
   useEffect(() => {
-    if (!location.hash) return;
+    if (false) return;
     const element = document.getElementById(location.hash.slice(1));
     if (element) {
killedBy: HelpCsvPage tests does not scroll when there is no hash
statusReason: expected "getElementById" to not be called at all, but actually been called 1 times

Received:

  1st getElementById call:

    Array [
      "",

[Killed] MethodExpression
main/pages/Help/HelpCsvPage.jsx:12:45
 
   useEffect(() => {
     if (!location.hash) return;
-    const element = document.getElementById(location.hash.slice(1));
+    const element = document.getElementById(location.hash);
     if (element) {
       element.scrollIntoView();
killedBy: HelpCsvPage tests scrolls to teams section when hash is present
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
main/pages/Help/HelpCsvPage.jsx:13:9
   useEffect(() => {
     if (!location.hash) return;
     const element = document.getElementById(location.hash.slice(1));
-    if (element) {
+    if (true) {
       element.scrollIntoView();
     }
killedBy: HelpCsvPage tests does not scroll when hash points to missing element
statusReason: Cannot read properties of null (reading 'scrollIntoView')

[Killed] BlockStatement
main/pages/Help/HelpCsvPage.jsx:13:18
   useEffect(() => {
     if (!location.hash) return;
     const element = document.getElementById(location.hash.slice(1));
-    if (element) {
-      element.scrollIntoView();
-    }
+    if (element) {}
   }, [location.hash]);
 
killedBy: HelpCsvPage tests scrolls to teams section when hash is present
statusReason: expected "vi.fn()" to be called at least once

[Killed] ArrayDeclaration
main/pages/Help/HelpCsvPage.jsx:16:6
     if (element) {
       element.scrollIntoView();
     }
-  }, [location.hash]);
+  }, []);
 
   return (
killedBy: HelpCsvPage tests re-runs scroll effect when hash changes
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] StringLiteral
main/pages/Help/HelpCsvPage.jsx:44:31
                 The following CSV format can be obtained from the EGradessystem
                 at UC Santa Barbara:
               </p>
-              <pre className={"csvExample"} data-testid="ucsbEgradesCsvExample">
+              <pre className={""} data-testid="ucsbEgradesCsvExample">
                 {csvFixtures.ucsbEgrades}
               </pre>
killedBy: HelpCsvPage tests renders with separate Team Information section and examples
statusReason: expect(element).toHaveClass("csvExample")

Expected the element to have class:
  csvExample
Received:

[Killed] StringLiteral
main/pages/Help/HelpCsvPage.jsx:247:31
             <Accordion.Header>Staff (by Email)</Accordion.Header>
             <Accordion.Body>
               <p>Upload staff using a CSV with the following columns:</p>
-              <pre className={"csvExample"} data-testid="staffCsvExample">
+              <pre className={""} data-testid="staffCsvExample">
                 {csvFixtures.staffByEmail}
               </pre>
killedBy: HelpCsvPage tests renders with separate Team Information section and examples
statusReason: expect(element).toHaveClass("csvExample")

Expected the element to have class:
  csvExample
Received:
