[Killed] BooleanLiteral
main/components/CourseStaff/CourseStaffTable.jsx:17:18
   currentUser,
   courseId,
   testIdPrefix = "CourseStaffTable",
-  isInstructor = true,
+  isInstructor = false,
 }) {
   const [showEditModal, setShowEditModal] = React.useState(false);
killedBy: CourseStaffTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="CourseStaffTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:25:12
   const [deleteStaff, setDeleteStaff] = React.useState(null);
 
   function cellToAxiosParamsDelete(formData) {
-    return {
-      // Stryker disable next-line StringLiteral
-      url: "/api/coursestaff/delete",
-      method: "DELETE",
-      params: {
-        id: formData.id,
-        courseId: courseId,
-        removeFromOrg: formData.removeFromOrg,
-      },
-    };
+    return {};
   }
 
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: Cannot read properties of undefined (reading 'params')

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:39:13
 
   const cellToAxiosParamsEdit = (formData) => ({
     url: `/api/coursestaff`,
-    method: "PUT",
+    method: "",
     // Stryker disable next-line ObjectLiteral
     params: {
killedBy: CourseStaffTable tests onEditSuccess calls toast and hideModal
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Staff member updated successfully.",

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:70:6
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
     { onSuccess: onDeleteSuccess },
-    [`/api/coursestaff/course?courseId=${courseId}`],
+    [``],
   );
 
killedBy: CourseStaffTable tests useBackendMutation is called with correct cache query key
statusReason: expected 1st "useBackendMutation" call to have been called with [ Any<Function>, …(2) ]

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:130:14
       let set_message;
 
       switch (orgStatus) {
-        case "PENDING":
+        case "":
           set_message =
             "Staff member cannot join the course until it has been completely set up.";
killedBy: CourseStaffTable tests tooltips for PENDING status
statusReason: Unable to find an element with the text: Staff member cannot join the course until it has been completely set up.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffTable.jsx:211:7
     },
   });
 
-  if (isInstructor && hasRole(currentUser, "ROLE_INSTRUCTOR")) {
+  if (true) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
killedBy: CourseStaffTable tests Has the expected column headers, content for ordinary user
statusReason: Found multiple elements with the text: Delete

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="CourseStaffTable-header-Delete-sort-header"
>

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffTable.jsx:211:7
     },
   });
 
-  if (isInstructor && hasRole(currentUser, "ROLE_INSTRUCTOR")) {
+  if (false) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
killedBy: CourseStaffTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="CourseStaffTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"
