[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:21:26
   testId = "InstructorCoursesTable",
   enableInstructorUpdate = false,
   deleteCourseButton = false,
-  courseNameLinkPrefix = "/instructor/courses",
+  courseNameLinkPrefix = "",
   canEditCourse,
   canInstallCourse,
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expect(element).toHaveAttribute("href", "/instructor/courses/1") // element.getAttribute("href") === "/instructor/courses/1"

Expected the element to have attribute:
  href="/instructor/courses/1"
Received:
  href="/1"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:33:14
 
   const canEdit = (row) => {
     if (canEditCourse !== undefined) {
-      return typeof canEditCourse === "function"
+      return false
         ? canEditCourse(row)
         : canEditCourse;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests supports permission override props
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-edit-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div />
  <div />
  <div>
    <table

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:80:28
           <OverlayTrigger
             placement="right"
             overlay={
-              <Tooltip id={`tooltip-coursename-${cell.row.index}`}>
+              <Tooltip id={``}>
                 View course details
               </Tooltip>
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests expect the correct tooltip ID for the courseName tooltips
statusReason: expect(element).toHaveAttribute("id", "tooltip-coursename-1") // element.getAttribute("id") === "tooltip-coursename-1"

Expected the element to have attribute:
  id="tooltip-coursename-1"
Received:
  id=""

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:86:19
             }
           >
             <Link
-              to={`${courseNameLinkPrefix}/${cell.row.original.id}`}
+              to={``}
               data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
             >
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expect(element).toHaveAttribute("href", "/instructor/courses/1") // element.getAttribute("href") === "/instructor/courses/1"

Expected the element to have attribute:
  href="/instructor/courses/1"
Received:
  href="/"

[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.jsx:139:12
     },
   ];
   const cellToAxiosParamsEdit = (formData) => {
-    return {
-      url: `/api/courses/updateInstructor`,
-      method: "PUT",
-      params: {
-        courseId: formData.courseId,
-        instructorEmail: formData.instructorEmail,
-      },
-    };
+    return {};
   };
 
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful API call and dismisses modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.jsx:153:15
     return {
       url: `/api/courses`,
       method: "PUT",
-      params: {
-        courseId: formData.courseId,
-        courseName: formData.courseName,
-        term: formData.term,
-        school: formData.school,
-      },
+      params: {},
     };
   };
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course update API call and shows success toast
statusReason: expected {} to deeply equal { courseId: 1, …(3) }

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:203:16
     // Stryker disable next-line OptionalChaining : defensive coding for error shape
     if (error.response?.data?.message)
       toast(`Could not delete course:\n${error.response.data.message}`);
-    else toast(`Could not delete course:\n${error.message}`);
+    else toast(``);
   };
 
killedBy: InstructorCoursesTable tests Shows fallback error toast when delete course API call fails without message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Could not delete course:

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:265:31
     window.location.href = url;
   };
 
-  const canInstall = (row) => {
-    if (canInstallCourse !== undefined) {
-      return typeof canInstallCourse === "function"
-        ? canInstallCourse(row)
-        : canInstallCourse;
-    }
-    if (row.original.orgName) {
-      return false;
-    }
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return true;
-    }
-    if (
-      hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.original.instructorEmail === currentUser.root.user.email
-    ) {
-      return true;
-    }
-
-    return false;
-  };
+  const canInstall = (row) => {};
 
   const renderTooltip = (cell) => {
killedBy: HomePageLoggedIn tests tables render correctly for instructor when courses exist
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:266:9
   };
 
   const canInstall = (row) => {
-    if (canInstallCourse !== undefined) {
+    if (true) {
       return typeof canInstallCourse === "function"
         ? canInstallCourse(row)
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-orgName-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] EqualityOperator
main/components/Courses/InstructorCoursesTable.jsx:266:9
   };
 
   const canInstall = (row) => {
-    if (canInstallCourse !== undefined) {
+    if (canInstallCourse === undefined) {
       return typeof canInstallCourse === "function"
         ? canInstallCourse(row)
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-orgName-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] EqualityOperator
main/components/Courses/InstructorCoursesTable.jsx:267:14
 
   const canInstall = (row) => {
     if (canInstallCourse !== undefined) {
-      return typeof canInstallCourse === "function"
+      return typeof canInstallCourse !== "function"
         ? canInstallCourse(row)
         : canInstallCourse;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests supports permission override props
statusReason: canInstallCourse is not a function

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:267:14
 
   const canInstall = (row) => {
     if (canInstallCourse !== undefined) {
-      return typeof canInstallCourse === "function"
+      return false
         ? canInstallCourse(row)
         : canInstallCourse;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests supports permission override props
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-orgName-no-org"]

Ignored nodes: comments, script, style
<body>
  <div />
  <div />
  <div>
    <table

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:271:9
         ? canInstallCourse(row)
         : canInstallCourse;
     }
-    if (row.original.orgName) {
+    if (true) {
       return false;
     }
killedBy: CoursesIndexPage tests Renders course data correctly for admin user
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:271:9
         ? canInstallCourse(row)
         : canInstallCourse;
     }
-    if (row.original.orgName) {
+    if (false) {
       return false;
     }
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element with the text: ucsb-cs156-s25. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:296:20
       set_message = `View organization associated with ${cell.row.original.courseName}.`;
     }
     return (
-      <Tooltip id={`tooltip-orgname-${cell.row.index}`}>{set_message}</Tooltip>
+      <Tooltip id={``}>{set_message}</Tooltip>
     );
   };
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests expect the correct tooltip ID for the orgName tooltips
statusReason: expect(element).toHaveAttribute("id", "tooltip-orgname-1") // element.getAttribute("id") === "tooltip-orgname-1"

Expected the element to have attribute:
  id="tooltip-orgname-1"
Received:
  id=""

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:321:48
               </span>
             </OverlayTrigger>
           );
-        } else if (!cell.row.original.orgName) {
-          return (
-            <span
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-no-org`}
-            ></span>
-          );
-        } else {
+        } else if (!cell.row.original.orgName) {} else {
           return (
             <div
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-3-col-orgName-no-org"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:324:28
         } else if (!cell.row.original.orgName) {
           return (
             <span
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-no-org`}
+              data-testid={``}
             ></span>
           );
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-3-col-orgName-no-org"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:343:34
                     href={`https://github.com/${cell.row.original.orgName}`}
                     target="_blank"
                     rel="noopener noreferrer"
-                    data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-github-link`}
+                    data-testid={``}
                   >
                     {cell.row.original.orgName}
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-orgName-github-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:378:15
       },
     },
     {
-      header: "Instructor",
+      header: "",
       accessorKey: "instructorEmail",
       cell: ({ cell }) => {
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element with the text: Instructor. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:459:22
   return (
     <>
       <Modal
-        data-testid={`${testId}-modal`}
+        data-testid={``}
         show={showModal}
         onHide={handleCloseModal}
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Opens modal when admin clicks instructor email
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:494:12
         </Modal.Header>
 
         <Modal.Body>
-          {courseToDelete && (
-            <p>
-              Please confirm that you really want to delete course{" "}
-              <strong>{courseToDelete.courseName}</strong>. This action cannot
-              be undone.
-            </p>
-          )}
+          {true}
         </Modal.Body>
 
killedBy: InstructorCoursesTable tests Delete modal opens when delete is clicked and closes when 'Do not delete' is clicked
statusReason: 
Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:496:68
         <Modal.Body>
           {courseToDelete && (
             <p>
-              Please confirm that you really want to delete course{" "}
+              Please confirm that you really want to delete course{""}
               <strong>{courseToDelete.courseName}</strong>. This action cannot
               be undone.
killedBy: InstructorCoursesTable tests Delete modal opens when delete is clicked and closes when 'Do not delete' is clicked
statusReason: 
Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>
