[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:24:20
   courseId,
   testIdPrefix,
   currentUser,
-  instructorView = true,
+  instructorView = false,
   canManageTeams,
 }) {
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: Unable to find an element with the text: team1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] OptionalChaining
main/components/TabComponent/TeamsTabComponent.jsx:44:30
   );
   const [searchTeams, setSearchTeams] = useState("");
 
-  const currentUserDetails = currentUser.root?.user;
+  const currentUserDetails = currentUser.root.user;
   const rosterStudentMatchesCurrentUser = (rosterStudent) => {
     if (!currentUserDetails || !rosterStudent) {
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of null (reading 'user')

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:45:62
   const [searchTeams, setSearchTeams] = useState("");
 
   const currentUserDetails = currentUser.root?.user;
-  const rosterStudentMatchesCurrentUser = (rosterStudent) => {
-    if (!currentUserDetails || !rosterStudent) {
-      return false;
-    }
-
-    return (
-      rosterStudent.user?.id === currentUserDetails.id ||
-      rosterStudent.email === currentUserDetails.email
-    );
-  };
+  const rosterStudentMatchesCurrentUser = (rosterStudent) => {};
 
   const teamsList = Array.isArray(teams) ? teams : [];
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: Unable to find an element with the text: team1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:46:48
 
   const currentUserDetails = currentUser.root?.user;
   const rosterStudentMatchesCurrentUser = (rosterStudent) => {
-    if (!currentUserDetails || !rosterStudent) {
-      return false;
-    }
+    if (!currentUserDetails || !rosterStudent) {}
 
     return (
killedBy: TeamTabComponent tests student view matches teams by user id or email and ignores missing members
statusReason: Unable to find an element with the text: email-team. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:46:32
 
   const currentUserDetails = currentUser.root?.user;
   const rosterStudentMatchesCurrentUser = (rosterStudent) => {
-    if (!currentUserDetails || !rosterStudent) {
+    if (!currentUserDetails || rosterStudent) {
       return false;
     }
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: Unable to find an element with the text: team1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:47:14
   const currentUserDetails = currentUser.root?.user;
   const rosterStudentMatchesCurrentUser = (rosterStudent) => {
     if (!currentUserDetails || !rosterStudent) {
-      return false;
+      return true;
     }
 
killedBy: TeamTabComponent tests student view matches teams by user id or email and ignores missing members
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h3
  data-testid="InstructorCourseShowPage-teams-table-24-name"
>
  missing-roster-student-team
</h3> instead

[Killed] OptionalChaining
main/components/TabComponent/TeamsTabComponent.jsx:51:7
     }
 
     return (
-      rosterStudent.user?.id === currentUserDetails.id ||
+      rosterStudent.user.id === currentUserDetails.id ||
       rosterStudent.email === currentUserDetails.email
     );
killedBy: TeamTabComponent tests student view matches teams by user id or email and ignores missing members
statusReason: Unable to find an element with the text: email-team. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] LogicalOperator
main/components/TabComponent/TeamsTabComponent.jsx:51:7
     }
 
     return (
-      rosterStudent.user?.id === currentUserDetails.id ||
-      rosterStudent.email === currentUserDetails.email
+      rosterStudent.user?.id === currentUserDetails.id && rosterStudent.email === currentUserDetails.email
     );
   };
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: Unable to find an element with the text: team1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] ConditionalExpression
main/components/TabComponent/TeamsTabComponent.jsx:52:7
 
     return (
       rosterStudent.user?.id === currentUserDetails.id ||
-      rosterStudent.email === currentUserDetails.email
+      false
     );
   };
killedBy: TeamTabComponent tests student view matches teams by user id or email and ignores missing members
statusReason: Unable to find an element with the text: email-team. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] EqualityOperator
main/components/TabComponent/TeamsTabComponent.jsx:52:7
 
     return (
       rosterStudent.user?.id === currentUserDetails.id ||
-      rosterStudent.email === currentUserDetails.email
+      rosterStudent.email !== currentUserDetails.email
     );
   };
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h3
  data-testid="InstructorCourseShowPage-teams-table-10-name"
>
  team-without-current-student
</h3> instead

[Killed] ArrayDeclaration
main/components/TabComponent/TeamsTabComponent.jsx:56:52
     );
   };
 
-  const teamsList = Array.isArray(teams) ? teams : [];
+  const teamsList = Array.isArray(teams) ? teams : ["Stryker was here"];
   const visibleTeams = instructorView
     ? teamsList.filter((team) =>
killedBy: TeamTabComponent tests Renders correctly when teams data is null/undefined
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] MethodExpression
main/components/TabComponent/TeamsTabComponent.jsx:58:7
 
   const teamsList = Array.isArray(teams) ? teams : [];
   const visibleTeams = instructorView
-    ? teamsList.filter((team) =>
-        team.name.toLowerCase().includes(searchTeams.toLowerCase()),
-      )
+    ? teamsList
     : teamsList.filter(
         (team) =>
killedBy: TeamTabComponent tests Search filter works correctly Search by Team Name.
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h3
  data-testid="InstructorCourseShowPage-teams-table-3-name"
>
  team1
</h3> instead

[Killed] ArrowFunction
main/components/TabComponent/TeamsTabComponent.jsx:58:24
 
   const teamsList = Array.isArray(teams) ? teams : [];
   const visibleTeams = instructorView
-    ? teamsList.filter((team) =>
-        team.name.toLowerCase().includes(searchTeams.toLowerCase()),
+    ? teamsList.filter(() => undefined,
       )
     : teamsList.filter(
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: Unable to find an element with the text: team1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] MethodExpression
main/components/TabComponent/TeamsTabComponent.jsx:59:42
   const teamsList = Array.isArray(teams) ? teams : [];
   const visibleTeams = instructorView
     ? teamsList.filter((team) =>
-        team.name.toLowerCase().includes(searchTeams.toLowerCase()),
+        team.name.toLowerCase().includes(searchTeams.toUpperCase()),
       )
     : teamsList.filter(
killedBy: TeamTabComponent tests Search filter works correctly Search by Team Name.
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-teams-table-3-name"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] MethodExpression
main/components/TabComponent/TeamsTabComponent.jsx:59:9
   const teamsList = Array.isArray(teams) ? teams : [];
   const visibleTeams = instructorView
     ? teamsList.filter((team) =>
-        team.name.toLowerCase().includes(searchTeams.toLowerCase()),
+        team.name.toUpperCase().includes(searchTeams.toLowerCase()),
       )
     : teamsList.filter(
killedBy: TeamTabComponent tests Search filter works correctly Search by Team Name.
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-teams-table-3-name"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] MethodExpression
main/components/TabComponent/TeamsTabComponent.jsx:61:7
     ? teamsList.filter((team) =>
         team.name.toLowerCase().includes(searchTeams.toLowerCase()),
       )
-    : teamsList.filter(
-        (team) =>
-          Array.isArray(team.teamMembers) &&
-          team.teamMembers.some((member) =>
-            rosterStudentMatchesCurrentUser(member.rosterStudent),
-          ),
-      );
+    : teamsList;
 
   const objectToAxiosParamsCSV = (formData) => {
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h3
  data-testid="InstructorCourseShowPage-teams-table-10-name"
>
  team-without-current-student
</h3> instead

[Killed] ArrowFunction
main/components/TabComponent/TeamsTabComponent.jsx:62:9
         team.name.toLowerCase().includes(searchTeams.toLowerCase()),
       )
     : teamsList.filter(
-        (team) =>
-          Array.isArray(team.teamMembers) &&
-          team.teamMembers.some((member) =>
-            rosterStudentMatchesCurrentUser(member.rosterStudent),
-          ),
+        () => undefined,
       );
 
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: Unable to find an element with the text: team1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] ConditionalExpression
main/components/TabComponent/TeamsTabComponent.jsx:63:11
       )
     : teamsList.filter(
         (team) =>
-          Array.isArray(team.teamMembers) &&
-          team.teamMembers.some((member) =>
-            rosterStudentMatchesCurrentUser(member.rosterStudent),
-          ),
+          true,
       );
 
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h3
  data-testid="InstructorCourseShowPage-teams-table-10-name"
>
  team-without-current-student
</h3> instead

[Killed] LogicalOperator
main/components/TabComponent/TeamsTabComponent.jsx:63:11
       )
     : teamsList.filter(
         (team) =>
-          Array.isArray(team.teamMembers) &&
-          team.teamMembers.some((member) =>
-            rosterStudentMatchesCurrentUser(member.rosterStudent),
-          ),
+          Array.isArray(team.teamMembers) || team.teamMembers.some(member => rosterStudentMatchesCurrentUser(member.rosterStudent)),
       );
 
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h3
  data-testid="InstructorCourseShowPage-teams-table-10-name"
>
  team-without-current-student
</h3> instead

[Killed] MethodExpression
main/components/TabComponent/TeamsTabComponent.jsx:64:11
     : teamsList.filter(
         (team) =>
           Array.isArray(team.teamMembers) &&
-          team.teamMembers.some((member) =>
-            rosterStudentMatchesCurrentUser(member.rosterStudent),
-          ),
+          team.teamMembers.every(member => rosterStudentMatchesCurrentUser(member.rosterStudent)),
       );
 
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: Unable to find an element with the text: team1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] ArrowFunction
main/components/TabComponent/TeamsTabComponent.jsx:64:33
     : teamsList.filter(
         (team) =>
           Array.isArray(team.teamMembers) &&
-          team.teamMembers.some((member) =>
-            rosterStudentMatchesCurrentUser(member.rosterStudent),
+          team.teamMembers.some(() => undefined,
           ),
       );
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: Unable to find an element with the text: team1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] ObjectLiteral
main/components/TabComponent/TeamsTabComponent.jsx:85:13
   const objectToAxiosParamsPost = (team) => ({
     url: `/api/teams/post`,
     method: "POST",
-    params: {
-      courseId: courseId,
-      name: team.name,
-    },
+    params: {},
   });
 
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected {} to deeply equal { courseId: 1, name: 'team5' }

[Killed] ObjectLiteral
main/components/TabComponent/TeamsTabComponent.jsx:91:55
     },
   });
 
-  const objectToAxiosParamsPushTeamsToGithub = () => ({
-    url: `/api/jobs/launch/pushTeamsToGithub`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-    },
-  });
+  const objectToAxiosParamsPushTeamsToGithub = () => ({});
 
   const objectToAxiosParamsPullTeamsFromGithub = () => ({
killedBy: TeamTabComponent tests Push teams to Github button works correctly
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:118:20
 
   const onSuccessTeams = (modalFn) => {
     toast("Team successfully added.");
-    setSearchTeams("");
+    setSearchTeams("Stryker was here!");
     modalFn(false);
   };
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:123:11
   };
 
   const onSuccessPushTeamsToGithub = () => {
-    toast("Push teams to Github job successfully started.");
+    toast("");
   };
 
killedBy: TeamTabComponent tests Push teams to Github button works correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Push teams to Github job successfully started.",

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:127:11
   };
 
   const onSuccessPullTeamsFromGithub = () => {
-    toast("Pull teams from Github job successfully started.");
+    toast("");
   };
 
killedBy: TeamTabComponent tests Pull teams from Github button works correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Pull teams from Github job successfully started.",

[Killed] ConditionalExpression
main/components/TabComponent/TeamsTabComponent.jsx:143:13
       },
       onError: (error) => {
         setPostTeamModal(false);
-        if (error.response.status === 409) {
+        if (false) {
           setErrorPostTeamModal({
             message: `Team name already exists. Please choose a different name.`,
killedBy: TeamTabComponent tests TeamForm (adding individual team) returns correct error when team already exists
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Team name already exists. Please choose a different name.
Received:
  Error Creating Team 409 error occurred while attempting to create team.

[Killed] ObjectLiteral
main/components/TabComponent/TeamsTabComponent.jsx:144:33
       onError: (error) => {
         setPostTeamModal(false);
         if (error.response.status === 409) {
-          setErrorPostTeamModal({
-            message: `Team name already exists. Please choose a different name.`,
-          });
+          setErrorPostTeamModal({});
         } else {
           setErrorPostTeamModal({
killedBy: TeamTabComponent tests TeamForm (adding individual team) returns correct error when team already exists
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Team name already exists. Please choose a different name.
Received:
  Error Creating Team

[Killed] ConditionalExpression
main/components/TabComponent/TeamsTabComponent.jsx:174:20
           setErrorPostCSVTeamModal({
             message: `Upload failed (Error 400). Please ensure your CSV follows one of the formats documented in the 'Help' section.`,
           });
-        } else if (error.response.status === 409) {
+        } else if (true) {
           setPartialSuccessPostCSVTeamModal({
killedBy: TeamTabComponent tests Returns correct error modal for CSV when unexpected error occurs and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-error-post-csv-team-modal"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:180:22
           });
         } else {
           setErrorPostCSVTeamModal({
-            message: `${JSON.stringify(error.response.status, null, 2)} error occurred while processing the CSV file.`,
+            message: ``,
           });
         }
killedBy: TeamTabComponent tests Returns correct error modal for CSV when unexpected error occurs and clears search filter
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  500 error occurred while processing the CSV file.
Received:
  CSV Import Unsuccessful

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:220:17
   };
 
   const openCsvHelp = () => {
-    window.open("/help/csv#team-information", "_blank");
+    window.open("", "_blank");
   };
 
killedBy: TeamTabComponent tests Info icon displays tooltip and opens help page on click
statusReason: expected "vi.fn()" to be called with arguments: [ '/help/csv#team-information', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/help/csv#team-information",

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:316:30
                     style={{
                       position: "absolute",
                       top: "50%",
-                      right: "0.75rem",
+                      right: "",
                       transform: "translateY(-50%)",
                       color: "#fff",
killedBy: TeamTabComponent tests Info icon displays tooltip and opens help page on click
statusReason: expect(element).toHaveStyle()

- Expected

- right: 0.75rem;

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:350:30
               <Button
                 onClick={handlePullTeamsFromGithub}
                 className="w-100"
-                data-testid={`${testIdPrefix}-pull-teams-button`}
+                data-testid={``}
               >
                 Pull Teams From Github
killedBy: TeamTabComponent tests Pull teams from Github button works correctly
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-pull-teams-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:381:25
           teams={visibleTeams}
           currentUser={currentUser}
           courseId={courseId}
-          testIdPrefix={`${testIdPrefix}-teams-table`}
+          testIdPrefix={``}
           instructorView={instructorView}
           canManageTeams={canManageTeams}
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-teams-table-accordion"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >
