[Killed] BooleanLiteral
main/components/Teams/TeamsTable.jsx:20:20
   currentUser,
   courseId,
   testIdPrefix = "TeamsTable",
-  instructorView = true,
+  instructorView = false,
   canManageTeams,
 }) {
killedBy: TeamsTable tests table renders corretly when there are teams
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-members-table-header-rosterStudent.githubLogin"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"

[Killed] LogicalOperator
main/components/Teams/TeamsTable.jsx:28:5
   const [errorPostMemberModal, setErrorPostMemberModal] = useState(false);
   const [selectedTeamKeys, setSelectedTeamKeys] = useState();
   const canManage =
-    canManageTeams ??
-    (instructorView && hasRole(currentUser, "ROLE_INSTRUCTOR"));
+    canManageTeams && instructorView && hasRole(currentUser, "ROLE_INSTRUCTOR");
   const defaultOpenTeamKeys = teams.map((_team, index) => `${index}`);
   const openTeamKeys = selectedTeamKeys ?? defaultOpenTeamKeys;
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-teams-table-3-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] ConditionalExpression
main/components/Teams/TeamsTable.jsx:29:6
   const [selectedTeamKeys, setSelectedTeamKeys] = useState();
   const canManage =
     canManageTeams ??
-    (instructorView && hasRole(currentUser, "ROLE_INSTRUCTOR"));
+    (true);
   const defaultOpenTeamKeys = teams.map((_team, index) => `${index}`);
   const openTeamKeys = selectedTeamKeys ?? defaultOpenTeamKeys;
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="me-3 btn btn-primary"
  data-testid="InstructorCourseShowPage-teams-table-3-add-member-button"
  type="button"
>
  Add Team Member

[Killed] LogicalOperator
main/components/Teams/TeamsTable.jsx:29:6
   const [selectedTeamKeys, setSelectedTeamKeys] = useState();
   const canManage =
     canManageTeams ??
-    (instructorView && hasRole(currentUser, "ROLE_INSTRUCTOR"));
+    (instructorView || hasRole(currentUser, "ROLE_INSTRUCTOR"));
   const defaultOpenTeamKeys = teams.map((_team, index) => `${index}`);
   const openTeamKeys = selectedTeamKeys ?? defaultOpenTeamKeys;
killedBy: TeamsTable tests If the user is not an instructor/admin, remove buttons are not rendered
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-danger"
  data-testid="TeamsTable-3-cell-row-0-col-Remove-button"
  type="button"
>
  Remove

[Killed] ArrowFunction
main/components/Teams/TeamsTable.jsx:30:41
   const canManage =
     canManageTeams ??
     (instructorView && hasRole(currentUser, "ROLE_INSTRUCTOR"));
-  const defaultOpenTeamKeys = teams.map((_team, index) => `${index}`);
+  const defaultOpenTeamKeys = teams.map(() => undefined);
   const openTeamKeys = selectedTeamKeys ?? defaultOpenTeamKeys;
 
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Killed] LogicalOperator
main/components/Teams/TeamsTable.jsx:31:24
     canManageTeams ??
     (instructorView && hasRole(currentUser, "ROLE_INSTRUCTOR"));
   const defaultOpenTeamKeys = teams.map((_team, index) => `${index}`);
-  const openTeamKeys = selectedTeamKeys ?? defaultOpenTeamKeys;
+  const openTeamKeys = selectedTeamKeys && defaultOpenTeamKeys;
 
   const { data: rosterStudents } = useBackend(
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:42:11
     { enabled: instructorView },
   );
   const onSuccessMember = (modalFn) => {
-    toast("Member added successfully");
+    toast("");
     modalFn(false);
   };
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected "vi.fn()" to be called with arguments: [ 'Member added successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Member added successfully",

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:54:36
     toast("Team removed successfully");
   };
 
-  const onDeleteGithubTeam = () => {
-    toast("Delete GitHub team job launched successfully");
-  };
+  const onDeleteGithubTeam = () => {};
 
   const onDeleteGithubMember = () => {
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Delete GitHub team job launched successfully",

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:58:38
     toast("Delete GitHub team job launched successfully");
   };
 
-  const onDeleteGithubMember = () => {
-    toast("Delete GitHub team member job launched successfully");
-  };
+  const onDeleteGithubMember = () => {};
 
   const onAddGithubMember = () => {
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Delete GitHub team member job launched successfully",

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:62:35
     toast("Delete GitHub team member job launched successfully");
   };
 
-  const onAddGithubMember = () => {
-    toast("Add GitHub team member job launched successfully");
-  };
+  const onAddGithubMember = () => {};
 
   const cellToAxiosParamsPost = (data) => ({
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Add GitHub team member job launched successfully",

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:63:11
   };
 
   const onAddGithubMember = () => {
-    toast("Add GitHub team member job launched successfully");
+    toast("");
   };
 
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Add GitHub team member job launched successfully",

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:69:13
   const cellToAxiosParamsPost = (data) => ({
     url: `/api/teams/addMember`,
     method: "POST",
-    params: {
-      courseId: courseId,
-      teamId: selectedTeam.id,
-      rosterStudentId: data.rosterStudentId,
-    },
+    params: {},
   });
 
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected {} to deeply equal { rosterStudentId: '4', …(2) }

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:82:53
     params: { id: team.id, courseId: courseId },
   });
 
-  const cellToAxiosParamDeleteMember = (member) => ({
-    method: "DELETE",
-    url: `/api/teams/removeMember`,
-    params: { teamMemberId: member.id, courseId: courseId },
-  });
+  const cellToAxiosParamDeleteMember = (member) => ({});
 
   const cellToAxiosParamDeleteGithubTeam = (team) => ({
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/components/Teams/TeamsTable.jsx:88:44
     params: { teamMemberId: member.id, courseId: courseId },
   });
 
-  const cellToAxiosParamDeleteGithubTeam = (team) => ({
-    method: "POST",
-    url: `/api/jobs/launch/deleteTeamFromGithub`,
-    params: { githubTeamId: team.githubTeamId, courseId: courseId },
-  });
+  const cellToAxiosParamDeleteGithubTeam = () => undefined;
 
   const cellToAxiosParamDeleteGithubMember = (data) => ({
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:88:55
     params: { teamMemberId: member.id, courseId: courseId },
   });
 
-  const cellToAxiosParamDeleteGithubTeam = (team) => ({
-    method: "POST",
-    url: `/api/jobs/launch/deleteTeamFromGithub`,
-    params: { githubTeamId: team.githubTeamId, courseId: courseId },
-  });
+  const cellToAxiosParamDeleteGithubTeam = (team) => ({});
 
   const cellToAxiosParamDeleteGithubMember = (data) => ({
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:89:13
   });
 
   const cellToAxiosParamDeleteGithubTeam = (team) => ({
-    method: "POST",
+    method: "",
     url: `/api/jobs/launch/deleteTeamFromGithub`,
     params: { githubTeamId: team.githubTeamId, courseId: courseId },
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/components/Teams/TeamsTable.jsx:94:46
     params: { githubTeamId: team.githubTeamId, courseId: courseId },
   });
 
-  const cellToAxiosParamDeleteGithubMember = (data) => ({
-    method: "POST",
-    url: `/api/jobs/launch/deleteTeamMemberFromGithub`,
-    params: {
-      memberGithubLogin: data.memberGithubLogin,
-      githubTeamId: data.githubTeamId,
-      courseId: courseId,
-    },
-  });
+  const cellToAxiosParamDeleteGithubMember = () => undefined;
 
   const cellToAxiosParamAddGithubMember = (data) => ({
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:94:57
     params: { githubTeamId: team.githubTeamId, courseId: courseId },
   });
 
-  const cellToAxiosParamDeleteGithubMember = (data) => ({
-    method: "POST",
-    url: `/api/jobs/launch/deleteTeamMemberFromGithub`,
-    params: {
-      memberGithubLogin: data.memberGithubLogin,
-      githubTeamId: data.githubTeamId,
-      courseId: courseId,
-    },
-  });
+  const cellToAxiosParamDeleteGithubMember = (data) => ({});
 
   const cellToAxiosParamAddGithubMember = (data) => ({
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:95:13
   });
 
   const cellToAxiosParamDeleteGithubMember = (data) => ({
-    method: "POST",
+    method: "",
     url: `/api/jobs/launch/deleteTeamMemberFromGithub`,
     params: {
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/components/Teams/TeamsTable.jsx:104:43
     },
   });
 
-  const cellToAxiosParamAddGithubMember = (data) => ({
-    method: "POST",
-    url: `/api/jobs/launch/addTeamMemberToGithub`,
-    params: {
-      memberGithubLogin: data.memberGithubLogin,
-      githubTeamId: data.githubTeamId,
-      teamMemberId: data.teamMemberId,
-      courseId: courseId,
-    },
-  });
+  const cellToAxiosParamAddGithubMember = () => undefined;
 
   const deleteTeamMutation = useBackendMutation(
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected 1 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:104:54
     },
   });
 
-  const cellToAxiosParamAddGithubMember = (data) => ({
-    method: "POST",
-    url: `/api/jobs/launch/addTeamMemberToGithub`,
-    params: {
-      memberGithubLogin: data.memberGithubLogin,
-      githubTeamId: data.githubTeamId,
-      teamMemberId: data.teamMemberId,
-      courseId: courseId,
-    },
-  });
+  const cellToAxiosParamAddGithubMember = (data) => ({});
 
   const deleteTeamMutation = useBackendMutation(
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected 1 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:117:5
 
   const deleteTeamMutation = useBackendMutation(
     cellToAxiosParamDeleteTeam,
-    { onSuccess: onDeleteTeam },
+    {},
     [`/api/teams/all?courseId=${courseId}`],
   );
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected "vi.fn()" to be called with arguments: [ 'Team removed successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Team removed successfully",

[Killed] ArrayDeclaration
main/components/Teams/TeamsTable.jsx:118:5
   const deleteTeamMutation = useBackendMutation(
     cellToAxiosParamDeleteTeam,
     { onSuccess: onDeleteTeam },
-    [`/api/teams/all?courseId=${courseId}`],
+    [],
   );
 
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected "invalidateQueries" to be called 2 times, but got 1 times

[Killed] ArrayDeclaration
main/components/Teams/TeamsTable.jsx:130:5
   const deleteGithubTeamMutation = useBackendMutation(
     cellToAxiosParamDeleteGithubTeam,
     { onSuccess: onDeleteGithubTeam },
-    [`/api/jobs/launch/deleteTeamFromGithub`],
+    [],
   );
 
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected "invalidateQueries" to be called 2 times, but got 1 times

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:141:5
 
   const addGithubMemberMutation = useBackendMutation(
     cellToAxiosParamAddGithubMember,
-    { onSuccess: onAddGithubMember },
+    {},
     [`/api/jobs/launch/addTeamMemberToGithub`],
   );
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Add GitHub team member job launched successfully",

[Killed] ArrayDeclaration
main/components/Teams/TeamsTable.jsx:142:5
   const addGithubMemberMutation = useBackendMutation(
     cellToAxiosParamAddGithubMember,
     { onSuccess: onAddGithubMember },
-    [`/api/jobs/launch/addTeamMemberToGithub`],
+    [],
   );
 
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected "invalidateQueries" to be called 2 times, but got 1 times

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:148:41
   const memberPostMutation = useBackendMutation(
     cellToAxiosParamsPost,
     {
-      onSuccess: (createdTeamMember) => {
-        onSuccessMember(setPostMemberModal);
-        const rosterStudent = rosterStudents.find(
-          (rs) => rs.id === createdTeamMember.rosterStudent.id,
-        );
-        addGithubMemberMutation.mutate({
-          memberGithubLogin: rosterStudent.githubLogin,
-          githubTeamId: selectedTeam.githubTeamId,
-          teamMemberId: createdTeamMember.id,
-        });
-      },
+      onSuccess: (createdTeamMember) => {},
       onError: (error) => {
         setPostMemberModal(false);
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected 1 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ArrowFunction
main/components/Teams/TeamsTable.jsx:151:11
       onSuccess: (createdTeamMember) => {
         onSuccessMember(setPostMemberModal);
         const rosterStudent = rosterStudents.find(
-          (rs) => rs.id === createdTeamMember.rosterStudent.id,
+          () => undefined,
         );
         addGithubMemberMutation.mutate({
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected 1 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ConditionalExpression
main/components/Teams/TeamsTable.jsx:151:19
       onSuccess: (createdTeamMember) => {
         onSuccessMember(setPostMemberModal);
         const rosterStudent = rosterStudents.find(
-          (rs) => rs.id === createdTeamMember.rosterStudent.id,
+          (rs) => false,
         );
         addGithubMemberMutation.mutate({
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected 1 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:153:40
         const rosterStudent = rosterStudents.find(
           (rs) => rs.id === createdTeamMember.rosterStudent.id,
         );
-        addGithubMemberMutation.mutate({
-          memberGithubLogin: rosterStudent.githubLogin,
-          githubTeamId: selectedTeam.githubTeamId,
-          teamMemberId: createdTeamMember.id,
-        });
+        addGithubMemberMutation.mutate({});
       },
       onError: (error) => {
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected { memberGithubLogin: undefined, …(3) } to deeply equal { memberGithubLogin: 'jonsnow', …(3) }

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:159:27
           teamMemberId: createdTeamMember.id,
         });
       },
-      onError: (error) => {
-        setPostMemberModal(false);
-        if (error.response.status === 409) {
-          setErrorPostMemberModal({
-            message: `This member is already in this team.`,
-          });
-        } else {
-          setErrorPostMemberModal({
-            message: `${JSON.stringify(error.status)} error occurred while adding member to the team.`,
-          });
-        }
-      },
+      onError: (error) => {},
     },
     [`/api/teams/all?courseId=${courseId}`],
killedBy: TeamsTable tests add member returns 409 error modal when member is already in the team
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="TeamsTable-post-modal"
>
  <div
    class="modal-content"

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:166:35
             message: `This member is already in this team.`,
           });
         } else {
-          setErrorPostMemberModal({
-            message: `${JSON.stringify(error.status)} error occurred while adding member to the team.`,
-          });
+          setErrorPostMemberModal({});
         }
       },
killedBy: TeamsTable tests add member returns generic error modal an unexpected error occurs
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  500 error occurred while adding member to the team.
Received:
  Error Creating Member

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:179:46
     memberPostMutation.mutate(data);
   };
 
-  const deleteTeamCallback = async (team) => {
-    deleteTeamMutation.mutate(team);
-    deleteGithubTeamMutation.mutate(team);
-  };
+  const deleteTeamCallback = async (team) => {};
 
   const deleteMemberCallback = async (cell, team) => {
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:184:54
     deleteGithubTeamMutation.mutate(team);
   };
 
-  const deleteMemberCallback = async (cell, team) => {
-    const member = cell.row.original;
-    deleteMemberMutation.mutate(member);
-    deleteGithubMemberMutation.mutate({
-      memberGithubLogin: member.rosterStudent.githubLogin,
-      githubTeamId: team.githubTeamId,
-    });
-  };
+  const deleteMemberCallback = async (cell, team) => {};
 
   const memberColumns = [
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:196:11
   const memberColumns = [
     ...(instructorView
       ? [
-          {
-            Header: "Roster Student ID",
-            accessor: "rosterStudent.id",
-          },
+          {},
         ]
       : []),
killedBy: TeamsTable tests table renders corretly when there are teams
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:204:17
       : []),
     {
       Header: "First Name",
-      accessor: "rosterStudent.firstName",
+      accessor: "",
     },
     {
killedBy: TeamsTable tests table renders corretly when there are teams
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-members-table-header-rosterStudent.firstName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"

[Killed] BooleanLiteral
main/components/Teams/TeamsTable.jsx:256:21
         <ModalBody>{errorPostMemberModal.message}</ModalBody>
       </Modal>
       <Accordion
-        alwaysOpen={!instructorView}
+        alwaysOpen={instructorView}
         activeKey={instructorView ? undefined : openTeamKeys}
         onSelect={instructorView ? undefined : setSelectedTeamKeys}
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] ConditionalExpression
main/components/Teams/TeamsTable.jsx:269:18
                   {team.name}
                 </h3>
 
-                {canManage && (
-                  <span className="ms-auto me-3">
-                    <Button
-                      onClick={(e) => {
-                        e.stopPropagation();
-                        setPostMemberModal(true);
-                        setSelectedTeam(team);
-                      }}
-                      data-testid={`${testIdPrefix}-${team.id}-add-member-button`}
-                      className="me-3"
-                    >
-                      Add Team Member
-                    </Button>
-                    <Button
-                      variant="danger"
-                      onClick={(e) => {
-                        e.stopPropagation();
-                        deleteTeamCallback(team);
-                      }}
-                      data-testid={`${testIdPrefix}-${team.id}-delete-button`}
-                    >
-                      Delete
-                    </Button>
-                  </span>
-                )}
+                {false}
               </span>
             </Accordion.Header>
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"

[Killed] ConditionalExpression
main/components/Teams/TeamsTable.jsx:269:18
                   {team.name}
                 </h3>
 
-                {canManage && (
-                  <span className="ms-auto me-3">
-                    <Button
-                      onClick={(e) => {
-                        e.stopPropagation();
-                        setPostMemberModal(true);
-                        setSelectedTeam(team);
-                      }}
-                      data-testid={`${testIdPrefix}-${team.id}-add-member-button`}
-                      className="me-3"
-                    >
-                      Add Team Member
-                    </Button>
-                    <Button
-                      variant="danger"
-                      onClick={(e) => {
-                        e.stopPropagation();
-                        deleteTeamCallback(team);
-                      }}
-                      data-testid={`${testIdPrefix}-${team.id}-delete-button`}
-                    >
-                      Delete
-                    </Button>
-                  </span>
-                )}
+                {true}
               </span>
             </Accordion.Header>
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:277:36
                         setPostMemberModal(true);
                         setSelectedTeam(team);
                       }}
-                      data-testid={`${testIdPrefix}-${team.id}-add-member-button`}
+                      data-testid={``}
                       className="me-3"
                     >
killedBy: StaffCourseShowPage tests staff users can still manage students and teams
statusReason: Unable to find an element by: [data-testid="StaffCourseShowPage-teams-table-3-add-member-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:288:36
                         e.stopPropagation();
                         deleteTeamCallback(team);
                       }}
-                      data-testid={`${testIdPrefix}-${team.id}-delete-button`}
+                      data-testid={``}
                     >
                       Delete
killedBy: StaffCourseShowPage tests staff users can still manage students and teams
statusReason: Unable to find an element by: [data-testid="StaffCourseShowPage-teams-table-3-delete-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:304:27
                   ...(canManage
                     ? [
                         ButtonColumn(
-                          "Remove",
+                          "",
                           "danger",
                           (cell) => deleteMemberCallback(cell, team),
killedBy: TeamsTable tests table renders corretly when there are teams
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Teams/TeamsTable.jsx:306:27
                         ButtonColumn(
                           "Remove",
                           "danger",
-                          (cell) => deleteMemberCallback(cell, team),
+                          () => undefined,
                           `${testIdPrefix}-${team.id}`,
                         ),
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
