[Killed] EqualityOperator
src/main/pages/HomePageLoggedIn.jsx:142:10
         <StudentCoursesTable testid={"CoursesTable"} />
         <h1>Your Staff Courses</h1>
         {staffCourses.length === 0 && <p>No staff courses yet.</p>}
-        {staffCourses.length > 0 && (
+        {staffCourses.length <= 0 && (
           <CoursesTable
             courses={staffCourses}
killedBy: HomePageLoggedIn tests right message on 400
statusReason: Unable to find an element by: [data-testid="StaffCoursesTable-cell-row-1-col-studentStatus-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
