[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:177:10
         <Tab eventKey={"jobs"} title={"Jobs"} className="pt-2">
           <JobTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
-        {showSettingsTab && (
-          <Tab eventKey={"settings"} title={"Settings"} className="pt-2">
-            <SettingsTabComponent courseId={courseId} testIdPrefix={testId} />
-          </Tab>
-        )}
+        {false}
       </Tabs>
     </BasicLayout>
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: Unable to find an element with the text: Settings. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:177:10
         <Tab eventKey={"jobs"} title={"Jobs"} className="pt-2">
           <JobTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
-        {showSettingsTab && (
-          <Tab eventKey={"settings"} title={"Settings"} className="pt-2">
-            <SettingsTabComponent courseId={courseId} testIdPrefix={testId} />
-          </Tab>
-        )}
+        {showSettingsTab || <Tab eventKey={"settings"} title={"Settings"} className="pt-2">
+            <SettingsTabComponent courseId={courseId} testIdPrefix={testId} />
+          </Tab>}
       </Tabs>
     </BasicLayout>
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: Unable to find an element with the text: Settings. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
