[Killed] StringLiteral
main/pages/Student/StudentCourseShowPage.jsx:23:18
     true,
   );
 
-  const testId = "StudentCourseShowPage";
+  const testId = "";
   return (
     <BasicLayout>
killedBy: StudentCourseShowPage tests renders loading message
statusReason: Unable to find an element by: [data-testid="StudentCourseShowPage-loading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Student/StudentCourseShowPage.jsx:31:30
       ) : (
         <div className="border rounded-3 p-4 mb-4">
           <div className="d-flex align-items-center gap-2">
-            <h1 data-testid={`${testId}-title`} className="h3 mb-0 fw-semibold">
+            <h1 data-testid={``} className="h3 mb-0 fw-semibold">
               {course.courseName}
             </h1>
killedBy: StudentCourseShowPage tests renders course header and my teams tab
statusReason: Unable to find an element by: [data-testid="StudentCourseShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Student/StudentCourseShowPage.jsx:40:31
           </div>
         </div>
       )}
-      <Tabs defaultActiveKey={"teams"}>
+      <Tabs defaultActiveKey={""}>
         <Tab eventKey={"teams"} title={"My Teams"} className="pt-2">
           <TeamsTabComponent
killedBy: StudentCourseShowPage tests renders course header and my teams tab
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] BooleanLiteral
main/pages/Student/StudentCourseShowPage.jsx:46:29
             courseId={courseId}
             testIdPrefix={testId}
             currentUser={currentUser}
-            instructorView={false}
+            instructorView={true}
           />
         </Tab>
killedBy: StudentCourseShowPage tests renders course header and my teams tab
statusReason: Found multiple elements with the text: Roster Student ID

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="StudentCourseShowPage-teams-table-3-members-table-header-rosterStudent.id-sort-header"
  style="cursor: pointer;"
