[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:17:18
   students,
   currentUser,
   courseId,
-  testIdPrefix = "RosterStudentTable",
+  testIdPrefix = "",
   canEditStudents,
 }) {
killedBy: RosterStudentTable tests renders empty table correctly
statusReason: Unable to find an element by: [data-testid="RosterStudentTable-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""

[Killed] ArrowFunction
main/components/RosterStudent/RosterStudentTable.jsx:25:33
   const [showDeleteModal, setShowDeleteModal] = React.useState(false);
   const [deleteStudent, setDeleteStudent] = React.useState(null);
 
-  const cellToAxiosParamsEdit = (formData) => ({
-    url: `/api/rosterstudents/update`,
-    method: "PUT",
-    params: {
-      studentId: formData.studentId,
-      firstName: formData.firstName,
-      lastName: formData.lastName,
-      id: formData.id,
-    },
-  });
+  const cellToAxiosParamsEdit = () => undefined;
 
   const hideEditModal = () => {
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: Cannot read properties of undefined (reading 'params')

[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentTable.jsx:25:48
   const [showDeleteModal, setShowDeleteModal] = React.useState(false);
   const [deleteStudent, setDeleteStudent] = React.useState(null);
 
-  const cellToAxiosParamsEdit = (formData) => ({
-    url: `/api/rosterstudents/update`,
-    method: "PUT",
-    params: {
-      studentId: formData.studentId,
-      firstName: formData.firstName,
-      lastName: formData.lastName,
-      id: formData.id,
-    },
-  });
+  const cellToAxiosParamsEdit = (formData) => ({});
 
   const hideEditModal = () => {
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: Cannot read properties of undefined (reading 'params')

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:45:11
   };
 
   const onEditSuccess = () => {
-    toast("Student updated successfully.");
+    toast("");
     hideEditModal();
   };
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: expected "vi.fn()" to be called with arguments: [ 'Student updated successfully.' ]

Received:

  1st vi.fn() call:

  [
-   "Student updated successfully.",

[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentTable.jsx:74:5
 
   const editMutation = useBackendMutation(
     cellToAxiosParamsEdit,
-    { onSuccess: onEditSuccess },
+    {},
     [`/api/rosterstudents/course/${courseId}`],
   );
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Edit Student
</div> instead

[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentTable.jsx:99:5
       accessorKey: "studentId",
     },
 
-    {
-      header: "First Name",
-      accessorKey: "firstName",
-    },
+    {},
     {
       header: "Last Name",
killedBy: StaffCourseShowPage tests renders course header and staff-appropriate tabs
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:101:20
 
     {
       header: "First Name",
-      accessorKey: "firstName",
+      accessorKey: "",
     },
     {
killedBy: RosterStudentTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentTable.jsx:115:5
       header: "GitHub Login",
       accessorKey: "githubLogin",
     },
-    {
-      id: "teams",
-      header: () => (
-        <OverlayTrigger
-          placement="right"
-          overlay={
-            <Tooltip id={`tooltip-teams-header`}>
-              A list of teams that the student is a member of.
-            </Tooltip>
-          }
-        >
-          <span>Teams</span>
-        </OverlayTrigger>
-      ),
-      accessorFn: (row) =>
-        Array.isArray(row.teams) ? row.teams.join(", ") : "",
-    },
+    {},
   ];
 
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:153:13
           break;
         case "OWNER":
           set_message =
-            "Student is an owner of the GitHub organization associated with this course.";
+            "";
           break;
         case "MEMBER":
killedBy: tooltips for OWNER status
statusReason: Unable to find an element with the text: Student is an owner of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:172:18
 
   columns.push({
     header: "Status",
-    accessorKey: "orgStatus",
+    accessorKey: "",
     cell: ({ cell }) => {
       const status = cell.row.original.orgStatus;
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.jsx:196:38
             <span className="text-primary">Invited</span>
           </OverlayTrigger>
         );
-      } else if (status === "OWNER") {
-        return (
-          <OverlayTrigger placement="right" overlay={renderTooltip("OWNER")}>
-            <span style={{ color: "purple" }}>Owner</span>
-          </OverlayTrigger>
-        );
-      } else if (status === "MEMBER") {
+      } else if (status === "OWNER") {} else if (status === "MEMBER") {
         return (
           <OverlayTrigger placement="right" overlay={renderTooltip("MEMBER")}>
killedBy: RosterStudentTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element with the text: Owner. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RosterStudentTable"

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:221:45
   });
 
   const canEditRoster =
-    canEditStudents ?? hasRole(currentUser, "ROLE_INSTRUCTOR");
+    canEditStudents ?? hasRole(currentUser, "");
 
   if (canEditRoster) {
killedBy: RosterStudentTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="RosterStudentTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RosterStudentTable"

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentTable.jsx:223:7
   const canEditRoster =
     canEditStudents ?? hasRole(currentUser, "ROLE_INSTRUCTOR");
 
-  if (canEditRoster) {
+  if (false) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
killedBy: RosterStudentTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="RosterStudentTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RosterStudentTable"

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:256:22
       <OurTable data={students} columns={columns} testid={testIdPrefix} />
       <div
         style={{ display: "none" }}
-        data-testid={`${testIdPrefix}-courseId`}
+        data-testid={``}
         data-course-id={`${courseId}`}
       />
killedBy: RosterStudentTable tests renders empty table correctly
statusReason: Unable to find an element by: [data-testid="RosterStudentTable-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RosterStudentTable"
