[Killed] BlockStatement
main/pages/Staff/StaffCourseShowPage.jsx:4:47
 import React from "react";
 import InstructorCourseShowPage from "main/pages/Instructor/InstructorCourseShowPage";
 
-export default function StaffCourseShowPage() {
-  return (
-    <InstructorCourseShowPage
-      testId="StaffCourseShowPage"
-      showSettingsTab={false}
-      staffTabIsInstructor={false}
-      canEditStudents={true}
-      canManageTeams={true}
-    />
-  );
-}
+export default function StaffCourseShowPage() {}
 
killedBy: StaffCourseShowPage tests renders course header and staff-appropriate tabs
statusReason: Unable to find an element by: [data-testid="StaffCourseShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/pages/Staff/StaffCourseShowPage.jsx:8:24
   return (
     <InstructorCourseShowPage
       testId="StaffCourseShowPage"
-      showSettingsTab={false}
+      showSettingsTab={true}
       staffTabIsInstructor={false}
       canEditStudents={true}
killedBy: StaffCourseShowPage tests renders course header and staff-appropriate tabs
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  aria-controls="react-aria-_r_1_-tabpane-settings"
  aria-selected="false"
  class="nav-link"
  data-rr-ui-event-key="settings"
  id="react-aria-_r_1_-tab-settings"

[Killed] BooleanLiteral
main/pages/Staff/StaffCourseShowPage.jsx:9:29
     <InstructorCourseShowPage
       testId="StaffCourseShowPage"
       showSettingsTab={false}
-      staffTabIsInstructor={false}
+      staffTabIsInstructor={true}
       canEditStudents={true}
       canManageTeams={true}
killedBy: StaffCourseShowPage tests staff tab is visible but does not allow staff add edit or delete
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="w-100 btn btn-primary"
  data-testid="StaffCourseShowPage-post-button"
  type="button"
>
  Add Staff Member

[Killed] BooleanLiteral
main/pages/Staff/StaffCourseShowPage.jsx:10:24
       testId="StaffCourseShowPage"
       showSettingsTab={false}
       staffTabIsInstructor={false}
-      canEditStudents={true}
+      canEditStudents={false}
       canManageTeams={true}
     />
killedBy: StaffCourseShowPage tests staff users can still manage students and teams
statusReason: Unable to find an element by: [data-testid="StaffCourseShowPage-RosterStudentTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/pages/Staff/StaffCourseShowPage.jsx:11:23
       showSettingsTab={false}
       staffTabIsInstructor={false}
       canEditStudents={true}
-      canManageTeams={true}
+      canManageTeams={false}
     />
   );
killedBy: StaffCourseShowPage tests staff users can still manage students and teams
statusReason: Unable to find an element by: [data-testid="StaffCourseShowPage-teams-table-3-add-member-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
