[Survived] ArrayDeclaration
main/components/Teams/TeamsTable.jsx:26:52
   const [postMemberModal, setPostMemberModal] = useState(false);
   const [selectedTeam, setSelectedTeam] = useState(null);
   const [errorPostMemberModal, setErrorPostMemberModal] = useState(false);
-  const [openTeamKeys, setOpenTeamKeys] = useState([]);
+  const [openTeamKeys, setOpenTeamKeys] = useState(["Stryker was here"]);
   const canManage =
     canManageTeams ??

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:31:19
     canManageTeams ??
     (instructorView && hasRole(currentUser, "ROLE_INSTRUCTOR"));
 
-  useEffect(() => {
-    if (!instructorView) {
-      setOpenTeamKeys(teams.map((_team, index) => `${index}`));
-    }
-  }, [instructorView, teams]);
+  useEffect(() => {}, [instructorView, teams]);
 
   const { data: rosterStudents } = useBackend(
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:32:26
     (instructorView && hasRole(currentUser, "ROLE_INSTRUCTOR"));
 
   useEffect(() => {
-    if (!instructorView) {
-      setOpenTeamKeys(teams.map((_team, index) => `${index}`));
-    }
+    if (!instructorView) {}
   }, [instructorView, teams]);
 
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Killed] BooleanLiteral
main/components/Teams/TeamsTable.jsx:32:9
     (instructorView && hasRole(currentUser, "ROLE_INSTRUCTOR"));
 
   useEffect(() => {
-    if (!instructorView) {
+    if (instructorView) {
       setOpenTeamKeys(teams.map((_team, index) => `${index}`));
     }
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Killed] ArrowFunction
main/components/Teams/TeamsTable.jsx:33:33
 
   useEffect(() => {
     if (!instructorView) {
-      setOpenTeamKeys(teams.map((_team, index) => `${index}`));
+      setOpenTeamKeys(teams.map(() => undefined));
     }
   }, [instructorView, teams]);
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:33:51
 
   useEffect(() => {
     if (!instructorView) {
-      setOpenTeamKeys(teams.map((_team, index) => `${index}`));
+      setOpenTeamKeys(teams.map((_team, index) => ``));
     }
   }, [instructorView, teams]);
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:63:11
   };
 
   const onDeleteGithubMember = () => {
-    toast("Delete GitHub team member job launched successfully");
+    toast("");
   };
 
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Delete GitHub team member job launched successfully",

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:70:44
     toast("Add GitHub team member job launched successfully");
   };
 
-  const cellToAxiosParamsPost = (data) => ({
-    url: `/api/teams/addMember`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      teamId: selectedTeam.id,
-      rosterStudentId: data.rosterStudentId,
-    },
-  });
+  const cellToAxiosParamsPost = (data) => ({});
 
   const cellToAxiosParamDeleteTeam = (team) => ({
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected +0 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:72:13
 
   const cellToAxiosParamsPost = (data) => ({
     url: `/api/teams/addMember`,
-    method: "POST",
+    method: "",
     params: {
       courseId: courseId,
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected +0 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:111:13
   const cellToAxiosParamAddGithubMember = (data) => ({
     method: "POST",
     url: `/api/jobs/launch/addTeamMemberToGithub`,
-    params: {
-      memberGithubLogin: data.memberGithubLogin,
-      githubTeamId: data.githubTeamId,
-      teamMemberId: data.teamMemberId,
-      courseId: courseId,
-    },
+    params: {},
   });
 
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected {} to deeply equal { memberGithubLogin: 'jonsnow', …(3) }

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:133:5
 
   const deleteGithubTeamMutation = useBackendMutation(
     cellToAxiosParamDeleteGithubTeam,
-    { onSuccess: onDeleteGithubTeam },
+    {},
     [`/api/jobs/launch/deleteTeamFromGithub`],
   );
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Delete GitHub team job launched successfully",

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:139:5
 
   const deleteGithubMemberMutation = useBackendMutation(
     cellToAxiosParamDeleteGithubMember,
-    { onSuccess: onDeleteGithubMember },
+    {},
     [`/api/jobs/launch/deleteTeamMemberFromGithub`],
   );
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Delete GitHub team member job launched successfully",

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:140:6
   const deleteGithubMemberMutation = useBackendMutation(
     cellToAxiosParamDeleteGithubMember,
     { onSuccess: onDeleteGithubMember },
-    [`/api/jobs/launch/deleteTeamMemberFromGithub`],
+    [``],
   );
 
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected "invalidateQueries" to be called with arguments: [ Array(1) ]

Received:

  1st invalidateQueries call:

  [
    {

[Killed] ArrayDeclaration
main/components/Teams/TeamsTable.jsx:140:5
   const deleteGithubMemberMutation = useBackendMutation(
     cellToAxiosParamDeleteGithubMember,
     { onSuccess: onDeleteGithubMember },
-    [`/api/jobs/launch/deleteTeamMemberFromGithub`],
+    [],
   );
 
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected "invalidateQueries" to be called 2 times, but got 1 times

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:146:6
   const addGithubMemberMutation = useBackendMutation(
     cellToAxiosParamAddGithubMember,
     { onSuccess: onAddGithubMember },
-    [`/api/jobs/launch/addTeamMemberToGithub`],
+    [``],
   );
 
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected "invalidateQueries" to be called with arguments: [ Array(1) ]

Received:

  1st invalidateQueries call:

  [
    {

[Killed] EqualityOperator
main/components/Teams/TeamsTable.jsx:155:19
       onSuccess: (createdTeamMember) => {
         onSuccessMember(setPostMemberModal);
         const rosterStudent = rosterStudents.find(
-          (rs) => rs.id === createdTeamMember.rosterStudent.id,
+          (rs) => rs.id !== createdTeamMember.rosterStudent.id,
         );
         addGithubMemberMutation.mutate({
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected { memberGithubLogin: null, …(3) } to deeply equal { memberGithubLogin: 'jonsnow', …(3) }

[Killed] ConditionalExpression
main/components/Teams/TeamsTable.jsx:155:19
       onSuccess: (createdTeamMember) => {
         onSuccessMember(setPostMemberModal);
         const rosterStudent = rosterStudents.find(
-          (rs) => rs.id === createdTeamMember.rosterStudent.id,
+          (rs) => true,
         );
         addGithubMemberMutation.mutate({
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected { memberGithubLogin: null, …(3) } to deeply equal { memberGithubLogin: 'jonsnow', …(3) }

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:191:39
   const deleteMemberCallback = async (cell, team) => {
     const member = cell.row.original;
     deleteMemberMutation.mutate(member);
-    deleteGithubMemberMutation.mutate({
-      memberGithubLogin: member.rosterStudent.githubLogin,
-      githubTeamId: team.githubTeamId,
-    });
+    deleteGithubMemberMutation.mutate({});
   };
 
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected { memberGithubLogin: undefined, …(2) } to deeply equal { Object (memberGithubLogin, githubTeamId, ...) }

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:224:19
           accessor: "rosterStudent.githubLogin",
         }
       : {
-          Header: "GitHub ID",
+          Header: "",
           accessor: "rosterStudent.githubId",
         },
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: Unable to find an element with the text: GitHub ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:262:33
       <Accordion
         alwaysOpen={!instructorView}
         activeKey={instructorView ? undefined : openTeamKeys}
-        onSelect={(eventKey) => {
-          if (!instructorView) {
-            setOpenTeamKeys(eventKey);
-          }
-        }}
+        onSelect={(eventKey) => {}}
         data-testid={`${testIdPrefix}-accordion`}
       >
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] ConditionalExpression
main/components/Teams/TeamsTable.jsx:263:15
         alwaysOpen={!instructorView}
         activeKey={instructorView ? undefined : openTeamKeys}
         onSelect={(eventKey) => {
-          if (!instructorView) {
+          if (false) {
             setOpenTeamKeys(eventKey);
           }
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:263:32
         alwaysOpen={!instructorView}
         activeKey={instructorView ? undefined : openTeamKeys}
         onSelect={(eventKey) => {
-          if (!instructorView) {
-            setOpenTeamKeys(eventKey);
-          }
+          if (!instructorView) {}
         }}
         data-testid={`${testIdPrefix}-accordion`}
killedBy: TeamTabComponent tests student view shows only current user's teams with no instructor controls
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] LogicalOperator
main/components/Teams/TeamsTable.jsx:277:18
                   {team.name}
                 </h3>
 
-                {canManage && (
-                  <span className="ms-auto me-3">
-                    <Button
-                      onClick={(e) => {
-                        e.stopPropagation();
-                        setPostMemberModal(true);
-                        setSelectedTeam(team);
-                      }}
-                      data-testid={`${testIdPrefix}-${team.id}-add-member-button`}
-                      className="me-3"
-                    >
-                      Add Team Member
-                    </Button>
-                    <Button
-                      variant="danger"
-                      onClick={(e) => {
-                        e.stopPropagation();
-                        deleteTeamCallback(team);
-                      }}
-                      data-testid={`${testIdPrefix}-${team.id}-delete-button`}
-                    >
-                      Delete
-                    </Button>
-                  </span>
-                )}
+                {canManage || <span className="ms-auto me-3">
+                    <Button onClick={e => {
+    e.stopPropagation();
+    setPostMemberModal(true);
+    setSelectedTeam(team);
+  }} data-testid={`${testIdPrefix}-${team.id}-add-member-button`} className="me-3">
+                      Add Team Member
+                    </Button>
+                    <Button variant="danger" onClick={e => {
+    e.stopPropagation();
+    deleteTeamCallback(team);
+  }} data-testid={`${testIdPrefix}-${team.id}-delete-button`}>
+                      Delete
+                    </Button>
+                  </span>}
               </span>
             </Accordion.Header>
killedBy: StaffCourseShowPage tests staff users can still manage students and teams
statusReason: Unable to find an element by: [data-testid="StaffCourseShowPage-teams-table-3-add-member-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
